[
  {
    "id": "0",
    "title": "Введение",
    "path": "intro",
    "subjects": [
      {
        "path": "intro-1",
        "theme": "Введение",
        "paragraphs": [
          "Особенность современного периода заключается в изменении условий хозяйственной деятельности.",
          "В этих условиях руководители предприятий всех форм собственности должны уметь в короткие сроки проводить оценку регулярно происходящих изменений и оценивать их влияние на состояние и перспективы развитие своего предприятия. Своевременное принятие правильных решений при изменении экономической ситуации является главной проблемой в управлении.",
          "Совершенно очевидно, что только лишь опыт и интуиция руководителей не могут обеспечить принятие правильных решений при изменении условий функционирования предприятия. Наиболее важным помощником руководителя становятся компьютерные информационные системы поддержки управленческих решений, которые позволяют смоделировать ситуацию и выбрать наилучший план действий. Использование методов математического моделирования и принятие на их основе обоснованных решений по управлению деятельностью предприятия является конкурентным преимуществом предприятия по отношению к предприятиям, действующим в тех же сегментах рынка и не использующим современные экономико-математические методы в управлении.",
          "Требования к современным специалистам обусловлены тем, что их профессиональная деятельность будет осуществляться в условиях нестабильного экономического окружения. Поэтому они должны уметь рационально мыслить, самостоятельно пополнять свои знания и навыки, владеть методами и культурой рационального управления. В настоящее время в России и странах Запада ощущается значительная потребность в системных аналитиках, быстрыми темпами развивается индустрия управленческого консультирования. Применение методологии имитационного моделирования является мощным помощником современного специалиста в области управления.",
          "Задачами учебного курса «Имитационное моделирование экономических систем» являются: ",
          "- изучение основ моделирования социально-экономических систем;",
          "- создание у студентов теоретической и практической подготовки, обеспечивающей им возможность использования имитационного моделирования в исследовании экономических систем;",
          "- обучение практическому использованию методов имитационного моделирования в управлении. ",
          "Качество усвоения теоретического материала курса «Имитационное моделирование экономических систем» студентами ЦДО УрГЭУ в процессе самостоятельного изучения контролируется одной письменной работой, двумя лабораторными работами. Процесс обучения заканчивается проведением заключительных учебных мероприятия (студент ЦДО прослушивает лекции, сдает итоговый тест и зачет). Допуск студента к заключительным учебным мероприятиям возможен только после успешной сдачи им контрольной работы и отчета по лабораторным работам."
        ]
      }
    ]
  },
  {
    "id": "1",
    "title": "Базовые понятия и термины",
    "path": "basicconceptsandterms",
    "subjects": [
      {
        "path": "basicconceptsandterms-1",
        "theme": "Базовые понятия и термины",
        "paragraphs": [
          "Банк моделей – набор математических моделей, способствующих принятию решений по управлению. ",
          "Валидация имитационной модели – проверка соответствия данных, получаемых в процессе машинной имитации, реальному ходу явлений, для описания которых создана модель. Производится тогда, когда экспериментатор убедился на предшествующей стадии (верификации) в правильности структуры (логики) модели. Состоит в том, что выходные данные после расчета на ЭВМ сопоставляются с имеющимися статистическими сведениями о моделируемой системе. ",
          "Верификация имитационной модели – проверка соответствия ее поведения предположениям экспериментатора. Это первый этап действительной подготовки к имитационному эксперименту. Подбираются некоторые исходные данные, для которых могут быть представлены результаты просчета. Если окажется, что ЭВМ выдает данные, противоречащие тем, которые ожидались при формировании модели, значит, модель неверна. В обратном случае переходят к следующему этапу проверки работоспособности модели – ее валидации.",
          "Граф модели – совокупность множества элементов и множества соответствий, отношений между элементами. Граф изображается в виде схемы, геометрически, при этом элементы множества элементов являются вершинами графа, а элементы множества соответствий – отрезками, соединяющими вершины",
          "Деловые игры – учебные имитационные игры, являющиеся методом активизации процесса обучения.",
          "Детерминированная имитация – вид машинной имитации, при которой используется детерминированная модель изучаемой системы, не учитывающая влияния случайных возмущений. ",
          "Детерминированная модель – аналитическое представление закономерности, операции и т.п., при которых для данной совокупности входных значений на выходе системы может быть получен единственный результат.",
          "Динамическая имитация – вид машинной имитации, расчет поведения модели в течение продолжительных периодов времени без изменения условий эксперимента.",
          "Динамическая модель – вид машинной имитации, расчет поведения модели в течение продолжительных периодов времени. ",
          "Дискретность – прерывность. Изменение экономических показателей во времени имеет прерывный характер, часто происходит скачками от одной даты (месяца, квартала, года) к другой. ",
          "Замкнутые модели - модели, позволяющие учесть влияние внешней среды и исследовать связь социально-экономического объекта с другими объектами.",
          "Игра – вид человеческой деятельности, способный воссоздавать другие виды человеческой деятельности",
          "Имитационные игры - игры, в которых важной частью воссоздания экспериментальной ситуации является имитационная модель среды, в которой исполнители ролей, моделируемые игроками, осуществляют свою деятельность. ",
          "Имитационная модель – численная экономико-математическая модель изучаемой системы, предназначенная для использования в процессе машинной имитации. Она является по существу программой для ЭВМ, а эксперимент над ней состоит в наблюдении за результатами расчетов по этой программе при различных задаваемых значениях экзогенных (вводимых) переменных.",
          "Имитационное моделирование – процесс конструирования модели реальной системы и постановки экспериментов на этой модели с целью либо понять поведение системы, либо оценить в рамках ограничений различные стратегии, обеспечивающие функционирование этой системы. ",
          "Имитационное моделирование – процесс конструирования модели реальной системы и постановки экспериментов на этой модели с целью либо понять поведение системы, либо оценить в рамках ограничений различные стратегии, обеспечивающие функционирование этой системы. ",
          "Имитировать – вообразить, постичь суть явления, не прибегая к экспериментам на реальном объекте. ",
          "Интерпретация – построение выводов по данным, полученным путем имитации.",
          "Информационные модели – модели, отображающие во взаимосвязи источники и потребители информации. ",
          "Каноническая модель - модель, характеризующая взаимодействие объекта с окружением через входы и выходы. ",
          "Качественные цели - цели, которые могут быть или достигнуты, или не достигнуты. Все результаты, приводящие к достижению цели, одинаково хороши, а все результаты, не приводящие к достижению цели, одинаково неудовлетворительны. Критерии оценки достижения подобных 9 целей принимают два значения: 1 – успех, 0 – неуспех. Чаще всего в модели подобные цели выступают в качестве ограничений.",
          "Количественные цели – цели, определение которых заключается в стремлении увеличить (или уменьшить) значение некоторой величины – критерия оптимальности, зависимость которой от переменных и факторов модели и составляет целевую функцию математической модели.",
          "Концептуальная модель - совокупность качественных зависимостей критериев оптимальности и ограничений от характеристик окружения, параметров и переменных объекта. Концептуальная модель определяет, от каких факторов зависит тот или иной показатель или выполнение условия, но не раскрывает количественный характер этих связей.",
          "Математическая модель – вид моделей, в которой взаимосвязи между элементами задаются в виде функциональных зависимостей между количественными переменными",
          "Машинная имитация, или имитация на ЭВМ,- экспериментальный метод изучения экономики с помощью электронно-вычислительных машин. Процесс имитации заключается в следующем: сначала сроится математическая модель изучаемого объекта, затем эта модель преобразуется в программу работы ЭВМ. В машину вводятся необходимые данные и ведется наблюдение за тем, как изменяются интересующие исследователя показатели: они подвергаются анализу, в частности статистической обработке.",
          "Метод фиксированного шага – метод отсчета системного времени при моделировании, при котором отсчет системного времени ведется через заранее определенные временные интервалы постоянной длины. ",
          "Метод шага до следующего события – метод отсчета системного времени, при котором состояние моделируемой системы обновляется с появлением каждого существенного события независимо от интервала времени между ними (моделирование протекает во времени событий).",
          "Моделирование – процесс разработки модели.",
          "Модели структуры – вид моделей, отображающих связи между компонентами объекта и внешней средой. Модели структуры подразделяются на канонические модели, модели внутренней структуры и модели иерархической структуры. ",
          "Модели функционирования включают в себя широкий спектр символических моделей, в частности:",
          "- модель жизненного цикла системы, описывающая процессы существования системы от зарождения замысла ее создания до прекращения функционирования; ",
          "- модели операций, выполняемых объектом; ",
          "- информационные модели, отображающие во взаимосвязи источники и потребители информации;",
          "- процедурные модели, описывающие порядок взаимодействия элементов исследуемого объекта при выполнении различных операций, в том числе и процедуры принятия управленческих решений. ",
          "Модель – представление объекта, системы или понятия (идеи) в некоторой форме, отличной от формы их реального существования.",
          "Модель внутренней структуры – модель, характеризующую состав компонентов объекта и связи между ними. ",
          "Модель жизненного цикла системы – модель, описывающая процессы существования системы от зарождения замысла ее создания до прекращения функционирования. ",
          "Модель иерархической структуры (дерево системы) – модель, в которой объект (целое) расчленяется на элементы более низкого уровня, действия которых подчинены интересам целого.",
          "Обратная связь – обратное воздействие выходных результатов управляемой системы на процесс управления. Выходные результаты после определенных преобразований (например, задержки на некоторое время, усиления и др.) подаются на вход системы с определенным знаком. Таким образом, обратная связь изменяет интенсивность процесса, регулирует выходной результат.",
          "Окружение - множество всех объектов вне системы, изменение характеристик которых влияет на систему или (и) характеристики которых изменяются вследствие поведения системы. ",
          "Определение системы – установление границ, ограничений и измерителей эффективности системы, подлежащей изучению. ",
          "Оптимизация – процесс нахождения экстремума рассматриваемой функции, т.е. выбор наилучшего варианта из множества возможных; процесс выработки оптимальных решений по приведению системы в наилучшее (оптимальное) состояние. ",
          "Оценка адекватности – повышение до приемлемого уровня степени уверенности, с которой можно судить относительно корректности выводов о реальной системе, полученных на основании обращения к модели. ",
          "Петля обратной связи – замкнутая цепочка взаимодействия, которая связывает исходное действие с его результатом, изменяющим характеристики окружающих условий и которые, в свою очередь, являются «информацией», вызывающей дальнейшие изменения. ",
          "Планирование – форма управленческой деятельности, заключающаяся в подготовке различных вариантов управленческих решений в виде прогнозов, проектов программ и планов, обосновании их оптимальности, обеспечение возможности выполнения и проверки их выполнения.",
          "Подготовка данных – отбор данных, необходимых для построения модели, и представление их в соответствующей форме. ",
          "Процедурные модели – модели, описывающие порядок взаимодействия элементов исследуемого объекта при выполнении различных операций, в том числе и процедуры принятия управленческих решений.",
          "Процесс принятия решений - часть управленческой деятельности, кульминационным моментом которой является выбор из множества альтернатив возможных курсов действий.",
          "Разомкнутые модели – модели, реализующие исследование внутренних процессов в экономической системе. ",
          "Система управления предприятия – элемент организационной структуры предприятия, в которую входят системы финансирования, планирования, организации и управления производством, контроля за выпуском продукции, учета, сбыта и т.д.",
          "Статистическое имитационное моделирование – имитационное моделирование, при котором воспроизводятся случайные явления. Случайные факторы при построении модели имитируются при помощи случайных чисел, формируемых ЭВМ. Статистическое имитационное моделирование базируется на численном статистическом методе решения математических задач, называемом методом Монте-Карло",
          "Статическая имитация – многократное повторение расчета в различных условиях проведения эксперимента на имитационной модели, не включающей в себя в качестве переменной время.",
          "Стоимостные модели, как правило, сопровождают модели функционирования объекта и по отношению к ним вторичны, «питаются» от них информацией и совместно с ними позволяют проводить комплексную технико-экономическую оценку объекта или его оптимизацию по экономическим критериям",
          "Стохастическая имитация – вид машинной имитации, отличающийся от детерминированной тем, что включает в модель в том или ином виде случайные возмущения, отражающие вероятностный характер моделируемой системы. ",
          "Стратегическое планирование – вид планирования, состоящий в разработке стратегических решений, предусматривающих выдвижение таких целей и стратегий поведения соответствующих объектов управления, реализация которых обеспечивает их эффективное функционирование в долгосрочной перспективе. ",
          "Технологические карты – схематические модели, отображающие логическую последовательность операций в сжатой форме и показывающие шаг за шагом ход того или иного процесса. ",
          "Транзакт – формальный запрос на какое-либо обслуживание.",
          "Трансляция модели – описание модели на языке программирования. ",
          "Управление – циклически повторяющийся процесс воздействия органа управления на управляемый объект, в котором последовательно на основании обработки исходной информации о состоянии объекта и оценки обстановки вырабатывается план достижения цели и меры для его реализации, осуществляется передача воздействия на объект управления и контроль их выполнения, коррекция плана в зависимости от изменения условий обстановки и состояния объекта, выработка и передача новых воздействий, выбранных из множества возможных вариантов и обеспечивающих достижение конкретной цели при оптимальных затратах ресурсов. ",
          "Формулирование модели – переход от реальной системы к некоторой логической схеме (абстрагирование). ",
          "Цели развития объекта – вид целей, направленных на достижение новых, желательных в каком-то смысле состояний или характеристик объекта. Цели развития объекта соответствуют фазе управления «планирование» и вытекают из целей системы верхнего уровня или по крайней мере являются им логически непротиворечивыми.",
          "Цели стабилизации объекта – вид целей, направленных на сохранение или поддержание в определенном состоянии характеристик объекта и соответствующих фазе управления «регулирование». Эти цели способствуют достижению результатов целей развития (утвержденного плана) и определяются на уровне исследуемой системы. ",
          "Экзогенные переменные - переменные, которые вводятся в модель извне. ",
          "Эндогенные переменные – величины, изменение которых происходит внутри моделируемой системы. Эндогенные величины называют также выходными. "
        ]
      }
    ]
  },
  {
    "id": "2",
    "title": "Введение в имитационное моделирование",
    "path": "introductiontosimulation",
    "subjects": [
      {
        "path": "introductiontosimulation-1",
        "theme": "Место имитационного моделирования в составе экономико-математических методов",
        "paragraphs": [
          "С известной степенью приближения в составе экономикоматематических методов можно выделить следующие разделы: ",
          "экономическая кибернетика: системный анализ экономики, теория экономической информации и теория управляющих систем, ",
          "математическая статистика: экономические приложения данной дисциплины – выборочный анализ, дисперсионный анализ, корреляционный анализ, регрессионный анализ, многомерный статистический анализ, факторный анализ и др.; ",
          "математическая экономия и изучающая те же вопросы с количественной стороны эконометрия: теория экономического роста, теория производственных функций, межотраслевые балансы, национальные счета, анализ спроса и потребления, региональный и пространственный анализ, глобальной моделирование и др.; ",
          "методы принятия оптимальных решений, в том числе исследований операций в экономике. Этот раздел включает в себя следующие дисциплины и методы: оптимальное (математическое) программирование, в том числе методы ветвей и границ, сетевые методы планирования и управления, программно-целевые методы планирования и управления, программно-целевые методы планирования и управления, теорию и методы управления запасами, теорию массового обслуживания, теорию игр, теорию и методы принятия решений, теорию расписаний. В оптимальное (математическое) программирование входят в свою очередь линейное программирование, нелинейное программирование, динамическое программирование, дискретное (целочисленное) программирование, дробно-линейное программирование, параметрическое программирование, сепарабельное программирование, стохастическое программирование, геометрическое программирование;",
          "методы и дисциплины, специфичные отдельно как для централизованно планируемой экономики, так и для рыночной (конкурентной) экономики. К первым можно отнести теорию оптимального функционирования экономики, оптимальное планирование, теорию оптимального ценообразования, модели материально-технического снабжения и др. Ко вторым – методы, позволяющие разработать модели свободной конкуренции, модели капиталистического цикла, модели монополии, модели индикативного планирования, модели теории фирмы и др.; ",
          "методы экспериментального изучения математических моделей. К ним относят, как правило, математические методы анализа и планирования экономических экспериментов, методы машинной имитации (имитационное моделирование), деловые игры. ",
          "Среди методов прикладного системного анализа имитационное моделирование является наиболее мощным инструментом исследования сложных систем, управление которыми связано с принятием решений в условиях неопределенности. По сравнению с другими методами такое моделирование позволяет рассматривать большое число альтернатив, улучшать качество управленческих решений и точнее прогнозировать их последствия. ",
          "Чтобы овладеть искусством имитационного эксперимента с моделью той или иной экономической системы, мало одного лишь пассивного знания математических основ имитационного моделирования и умения разбираться в известных в теории моделях, сильно упрощающих реальные проблемы. Необходимо знакомство с практическими аспектами условий функционирования экономической системы. ",
          "Недаром книга одного из ведущих специалистов в области имитационного моделирования Роберта Шеннона носит название «Имитационное моделирование систем – искусство и наука» [13]. Этим подчеркивается, что создание модели сложной системы и проведение с ее использованием экспериментов является не только наукой. Такие процессы, как отбор существенных факторов для построения модели, введение упрощающих допущений и принятие правильных решений на основе моделей ограниченной точности опираются в значительной степени на интуицию исследователя и его практический опыт. ",
          "О необходимости для исследователя или коллектива исследователей уметь творчески подходить к изучению сложных систем говорится и в книге: ",
          "«Существует распространенное заблуждение, что для решения многих проблем управления производством достаточно, чтобы экономист сформулировал задачу, а математик нашел метод ее решения. Если бы дело обстояло так просто, то большинство проблем совершенствования управления были бы давно решены. В действительности между постановкой задачи и ее решением на ЭВМ лежит обширная сфера деятельности – системное моделирование, где необходимо в одинаковой степени хорошо владеть как содержательными аспектами исследуемой экономической задачи, так и методами и приемами построения модели». "
        ]
      },
      {
        "path": "introductiontosimulation-2",
        "theme": "Краткий обзор истории использования имитационного моделирования в исследовании экономических процессов",
        "paragraphs": [
          "Неправильно думать, что использование моделей началось с появлением ЭВМ. Само по себе моделирование не ново – формирование понятия моделирования и разработка моделей играли жизненно важную роль в духовной деятельности человечества с тех пор, как оно стало стремиться к пониманию и изменению окружающей среды. Люди всегда использовали концепцию модели, пытаясь представить и выразить с ее помощью абстрактные идеи и реальные объекты. Моделирование охватывает широкий диапазон актов человеческого общения и началось оно, возможно, с наскальной живописи и сооружения идолов. Прогресс и история науки и техники нашли свое наиболее точное выражение в развитии способности человека создавать модели естественных явлений, понятий и объектов",
          "В Массачусетском технологическом институте в 40-50 гг. прошлого века была создана методология междисциплинарных исследований сложных динамических систем (системной динамики), рождение которой связывают с именем Дж. Форрестера. Системная динамика, рассчитанная сначала на решение проблем управления в промышленности, была впоследствии расширена для анализа широкого класса динамических систем – экономических, социальных, экологических. Особенно много интересных результатов было получено на стыке различных дисциплин, например, проблемы развития города с учетом социальных и экономических процессов. В работах по моделированию всей мировой системы в целом, получивших впоследствии название «глобального моделирования», впервые мир рассматривался как единая система различных взаимодействующих процессов: демографических, промышленных, добычи и исчерпания природных ресурсов, загрязнения окружающей среды, производства продуктов питания и т.д. Компьютерные эксперименты, проведенные Д. Форрестером с глобальной моделью, показали, что в середине ХХI века человечество ждет кризис, связанный прежде всего с истощением природных ресурсов, падением численности населения и производства продуктов, ростом загрязнения окружающей среды. ",
          "Лауреат Нобелевской премии по экономике В. В. Леонтьев является создателем теории межотраслевого баланса экономических систем. В практическом применении отраслевого баланса широко используются методы моделирования систем, в частности, сценарный подход. Так, после второй мировой войны по заказу правительства США В.В.Леонтьевым была построена статическая модель межотраслевого баланса американской экономики с целью оценки последствий ее перехода на мирные рельсы, которая, в частности, предсказала неожиданный для экспертов результат – резкое увеличение выпуска и уровня занятости в сталелитейной промышленности. В семидесятых годах прошлого века по заказу ООН была создана глобальная экономическая модель развития мировой экономики. Непосредственной целью исследований с помощью этой модели являлось оценка условий, которые позволили бы сократить разрыв в доходах между развивающимися и развитыми странами",
          "Известны результаты глобального моделирования явления 'ядерной зимы', выполненные в ВЦ АН СССР под руководством академика Н.Н.Моисеева. Эти результаты дали человечеству, в том числе политикам, неопровержимые аргументы против ядерной войны, даже так называемой 'ограниченной ядерной войны'.",
          "Для математического моделирования и вычислительного эксперимента использовались, главным образом, универсальные цифровые вычислительные машины, доступные коллективам исследователей. В СССР в 70-80-х годах прошлого века это были БЭСМ-6 и модели ЕС ЭВМ, для которых разрабатывались библиотеки и пакеты прикладных программ вычислительной математики. С появлением персональных компьютеров стало возможно развитие информационной технологии вычислительного эксперимента, которая предусматривает поддержку пользовательского интерфейса и поиска нужных алгоритмов и программ с помощью персональных компьютеров или суперкомпьютеров."
        ]
      },
      {
        "path": "introductiontosimulation-3",
        "theme": "Мысленные и машинные модели социальных систем",
        "paragraphs": [
          "Каждый человек в своей личной и общественной жизни использует модели для принятия решений [12]. Мысленный образ мира, окружающего нас, есть модель. Человек не несет в себе полных образов семьи, бизнеса, правительства или страны. Он только отбирает концепции и взаимосвязи, которые затем использует, чтобы представить себе реальную систему. Мысленный образ – это модель, но, сожалению, модель не строгая а «размытая», она несовершенно, неточно сформулирована и может у одной и той же личности изменяться со временем, даже в течение беседы. Человеческий ум отбирает некоторые концепции, которые могут быть справедливы или ошибочны, и использует их для описания окружающего мира. На основе этих предположений человек оценивает поведение системы и думает о том, какое действие следует предпринять, что его изменить. Однако этот процесс часто приводит к ошибкам вследствие того, что человеческий ум в высшей степени приспособлен к анализу элементарных сил и действий, составляющих систему, но, как показывает опыт, не приспособлен для оценок динамических последствий развития достаточно сложных систем",
          "Здесь может помочь инструмент – компьютер, который «руководствуется» заданной ему моделью. Любая модель, конечно, есть упрощение действительно существующей социальной системы, но она может быть значительно более детальной, чем мысленные модели, которые обычно используются для обсуждений социально-экономических систем. Несмотря на свойственные им недостатки, машинные модели могут быть построены так, что они окажутся гораздо более полными, чем интуитивные модели",
          "По мнению Дж. Форрестера, процесс моделирования использует великую силу человеческого интеллекта – его способность к восприятию окружающего мира, и устраняет величайшую слабость человеческого ума – его неспособность оценить все динамические последствия даже при правильном наборе исходных предпосылок. ",
          "Томас Нейлор считает, что оценку эффективности экономических решений лица, ответственные за их выработку, могут проводить одним из трех способов. Во-первых, есть возможность, по крайней мере теоретическая, проводить управляемые эксперименты с экономической системой (фирмой, отраслью или экономикой страны). Однако на практике такая возможность обычно оказывается неосуществимой: бюрократические, социальные, политические и другие ограничения не дают провести эксперимент с отраслью или экономикой в целом. Фирме иногда удается осуществить соответствующие эксперимент, например, с различными вариантами рекламной и рыночной политик, а затем сравнить их результаты. Тем не менее, маловероятно, что в тех редких случаях, когда проводятся реальные эксперименты с экономическими системами, можно сохранить значения всех переменных неизменными и тем самым получить надежное сравнение различных экономических решений.",
          "Во-вторых, если есть данные о развитии экономической системы за некоторый период времени в прошлом, можно попытаться провести эксперимент на этих данных. Пусть, например, имеется временной ряд значений какой-то экономической переменной (например, дохода на душу населения) для нескольких государств. Предположим, что различия в значениях рассматриваемой переменной для разных государств можно объяснить несколькими параметрами экономической политики и малыми случайными возмущениями. Тогда, в принципе, можно оценить воздействие различных экономических решений на доход, приходящийся на душу населения. Часто данных о развитии системы в прошлом нет; но, даже когда их достаточно, предположение о том, что различия в значениях эндогенных переменных в данный момент объясняются главным образом воздействием управляющих переменных, вообще говоря, неоправданно; поэтому нельзя слишком доверять оценкам экономических решений, полученным на основе данных о развитии системы в прошлом. ",
          "Когда же нельзя провести управляемый эксперимент и нет данных о развитии системы в прошлом (или в этих данных слишком велики случайные возмущения), остается единственная возможность: построить модель рассматриваемой экономической системы, связывающую эндогенные переменные с экзогенными и провести имитационный эксперимент."
        ]
      },
      {
        "path": "introductiontosimulation-4",
        "theme": "Общая характеристика имитационного моделирования",
        "paragraphs": [
          "Управление в современном мире становится все более трудным делом, поскольку организационные структуры постоянно усложняются. Эта сложность объясняется характером взаимоотношений между различными элементами экономических систем и физическим системами, с которыми они взаимодействуют. Изменение одной из характеристик системы приводит к изменениям в других частях системы, что привело к развитию методологии системного анализа. Одним из наиболее важных и полезных орудий анализа структуры сложных процессов и систем стало имитационное моделирование.",
          "Имитировать – значит вообразить, постичь суть явления, не прибегая к экспериментам на реальном объекте. По существу, каждая модель есть форма имитации. Р. Шеннон дает следующее, ставшее классическим, определение: ",
          "Имитационное моделирование есть процесс конструирования модели реальной системы и постановки экспериментов на этой модели с целью либо понять поведение системы, либо оценить (в рамках ограничений, накладываемых некоторым критерием или совокупностью критериев) различные стратегии, обеспечивающие функционирование данной системы",
          "Исследование экономических систем проходит по следующим этапам: ",
          "- наблюдение системы, ",
          "- формулировка математической модели, с помощью которой пытаются объяснить поведение системы; ",
          "- предсказание поведения системы на основании этой модели с помощью расчетов; ",
          "- проведение экспериментов для проверки пригодности модели. ",
          "Машинная имитация как средство анализа экономических систем предназначена для того, чтобы помочь осуществить перечисленные этапы исследования. "
        ]
      },
      {
        "path": "introductiontosimulation-5",
        "theme": " Социально-экономические процессы как объекты моделирования",
        "paragraphs": [
          "Модели социально-экономических систем имеют некоторые особенности по сравнению, например, с моделями природных или технических систем. К сожалению, не всегда возможно создать математическую модель социально-экономической системы в узком значении этого слова. При изучении таких систем мы можем определить цели, указать ограничения и предусмотреть, чтобы система подчинялась техническим законам, нормативным правовым ограничениям и т.п. При этом могут быть вскрыты и представлены в той или иной математической форме существенные связи в системе. В отличие от этого решение проблем защиты от загрязнения воздушной среды, предотвращения преступлений, здравоохранения и огромное количество другим проблем связано с неясными и противоречивыми целями, а также выбором альтернатив, диктуемых политическими и социальными факторами.",
          "Можно выделить следующие ситуации, в которых рекомендуется использовать имитационное моделирование при изучении сложных социально-экономических систем: ",
          "- экономическая система сформировалась недавно и идет процесс ее познания;",
          "- имитационное моделирование дает более простой способ решения задачи, чем аналитический метод; ",
          "- имитационное моделирование оказывается единственным способом исследования сложной системы из-за невозможности наблюдения ее в реальных условиях или из-за того, что проведение экспериментов на реальных объектах связано с возможностями социальных и экономических потерь; ",
          "- необходимо исследовать процессы в другом масштабе времени; ",
          "- необходимо качественно подготовить специалистов для работы в какой-либо экономической системе; ",
          "-следует предсказать неочевидные нежелательные явления в системе. ",
          "Социально-экономические системы отличаются большой сложностью. Успешное их функционирование зависит от большого количества разнообразных факторов, среди которых можно выделить: ",
          "- социально-политические, ",
          "- нормативно-правовые, ",
          "- технические, технологические, зоотехнические, агрономические, климатические и т.п., ",
          "- экологические",
          "- маркетинговые",
          "- финансовые.",
          "Набор таких факторов может достигать десятков, сотен и более. Поэтому экспериментировать с реальными экономическими системами часто бывает невозможно, непрактично или неэкономично. Имитационный же эксперимент позволяет проводить исследование функционирования таких систем. "
        ]
      },
      {
        "path": "introductiontosimulation-6",
        "theme": "Структура имитационных моделей",
        "paragraphs": [
          "Математическая структура модели может быть очень сложной, однако в самом общем виде ее математически можно представить в виде где E - результат действия системы, - переменные и параметры, которыми мы можем управлять, - переменные и параметры, которыми мы управлять не можем. ",
          "Почти каждая модель представляет собой некоторую комбинацию таких составляющих, как компоненты, переменные, параметры, функциональные зависимости, ограничения, целевые функции. ",
          "Компоненты – составные части, которые при соответствующем объединении образуют систему. Например, модель города может состоять из таких компонентов, как система образования, система здравоохранения, транспортная система и т.д. ",
          "Параметры – величины, которые экспериментатор, работающий с моделью, может выбирать произвольно, в отличие от переменных, которые могут принимать только значения, определяемые видом функции. В моделях систем принято разделять переменные на экзогенные и эндогенные. Эндогенными называются переменные, изменение которых происходит внутри моделируемой системы, в отличие от экзогенных, которые вводятся в модель извне. Эндогенные величины называют также выходными.",
          "Функциональные зависимости описывают поведение переменных и параметров в пределах компонента или выражают соотношения между компонентами системы. Обычно эти соотношения можно строить лишь на основе гипотез или выводить с помощью статистического или математического анализа.",
          "Ограничения представляют собой устанавливаемые пределы изменения значений переменных или ограничивающие условия распределения и расходования тех или иных средств. Они могут вводиться либо разработчиком (искусственные ограничения), либо самой системой вследствие присущих ей свойств (естественные ограничения). ",
          "Целевая функция, или функция критерия, - это точное отображение целей или задач системы и необходимых правил оценки их выполнения. Для экономических систем принято выделять два типа целей – приобретение и сохранение. Цели сохранения связаны с сохранением или поддержанием каких-либо ресурсов или состояний. Цели приобретения связаны с приобретением новых ресурсов (прибыли, персонала, заказчиков, покупателей и т.п.). Четкое определение целевой функции оказывает громадное влияние на процесс создания модели и проведения на ней экспериментов. Неправильное определение целевой функции обычно ведет к неправильным заключениям. "
        ]
      },
      {
        "path": "introductiontosimulation-7",
        "theme": "Классификация моделей",
        "paragraphs": [
          "По факту использования в модели фактора времени модели делятся на статические и динамические. ",
          "Статическая имитация – многократное повторение расчета в различных условиях проведения эксперимента на имитационной модели, не включающей в себя в качестве переменной время. Соответственно, статическая модель не включает в качестве переменной время. ",
          "Динамическая модель – вид машинной имитации, расчет поведения модели в течение продолжительных периодов времени. ",
          "По виду используемых в модели переменных модели делятся на детерминированные и стохастические (статистические). ",
          "Детерминированная модель – аналитическое представление закономерности, операции и т.п., при которых для данной совокупности входных значений на выходе системы может быть получен единственный результат. ",
          "Стохастическая или статистическая модель – вид модели, отличающийся от детерминированной тем, что включает в себя в том или ином виде случайные возмущения, отражающие вероятностный характер моделируемой системы. ",
          "По целевому назначению модели подразделяются на модели структуры, функционирования и стоимостные (модели расхода ресурсов). ",
          "Модели структуры отображают связи между компонентами объекта и внешней средой и подразделяются на: ",
          "- каноническую модель, характеризующую взаимодействие объекта с окружением через входы и выходы; ",
          "- модель внутренней структуры, характеризующую состав компонентов объекта и связи между ними;",
          "- модель иерархической структуры (дерево системы), в которой объект (целое) расчленяется на элементы более низкого уровня, действия которых подчинены интересам целого. ",
          "Модели функционирования включают широкий спектр символических моделей, например: ",
          "- модель жизненного цикла системы, описывающая процессы существования системы от зарождения замысла ее создания до прекращения функционирования; ",
          "- модели операций, выполняемых объектом; ",
          "- информационные модели, отображающие во взаимосвязи источники и потребители информации; ",
          "- процедурные модели, описывающие порядок взаимодействия элементов исследуемого объекта при выполнении различных операций, в том числе и процедуры принятия управленческих решений. ",
          "Стоимостные модели, как правило, сопровождают модели функционирования объекта и по отношению к ним вторичны, «питаются» от них информацией и совместно с ними позволяют проводить комплексную технико-экономическую оценку объекта или его оптимизацию по экономическим критериям. "
        ]
      }
    ]
  },
  {
    "id": "3",
    "title": "Процесс имитации",
    "path": "simulationprocess",
    "subjects": [
      {
        "path": "simulationprocess-1",
        "theme": "Основные этапы процесса имитации",
        "paragraphs": [
          "Роберт Шеннон выделяет следующие этапы процесса имитации:",
          "1. Определение системы – установление границ, ограничений и измерителей эффективности системы, подлежащей изучению. ",
          "2. Формулирование модели – переход от реальной системы к некоторой логической схеме (абстрагирование).",
          "3. Подготовка данных – отбор данных, необходимых для построения модели, и представление их в соответствующей форме. ",
          "4. Трансляция модели – описание модели на языке программирования. ",
          "5. Оценка адекватности – повышение до приемлемого уровня степени уверенности, с которой можно судить относительно корректности выводов о реальной системе, полученных на основании обращения к модели. ",
          "6. Стратегическое планирование – планирование эксперимента, который должен дать необходимую информацию. ",
          "7. Тактическое планирование – определение способа проведения каждой серии испытаний, предусмотренных планом эксперимента. ",
          "8. Экспериментирование – процесс осуществления имитации с целью получения желаемых данных и анализа чувствительности. ",
          "9. Интерпретация – построение выводов по данным, полученным путем имитации. ",
          "10. Реализация – практическое использование модели и результатов моделирования. ",
          "11. Документирование – регистрация хода осуществления проекта и его результатов, а также документирование процесса создания и использования модели. "
        ]
      },
      {
        "path": "simulationprocess-2",
        "theme": "Определение системы. Постановка задачи",
        "paragraphs": [
          "Роберт Шеннон утверждает: «Эйнштейн как-то сказал, что правильная постановка задачи даже более важна, чем ее решение. Как это ни покажется странным, слишком много ученых, занимающихся процессами управления, ежегодно расходуют миллионы долларов, чтобы получить изящные и хитроумные ответы на некорректно поставленные вопросы». В условиях современной России вряд ли актуален вопрос об избыточном расходовании средств в таких масштабах на эти цели, вопрос же о правильном выборе системы для исследования или планирования остается весьма актуальным. ",
          "Большинство практических задач представляется руководителям в недостаточно точной, нечеткой форме, поэтому во многих случаях руководство не может или не способно выразить суть своих проблем. Оно знает, что некая проблема существует, но не может точно сформулировать, какая это проблема. Опыт показывает, что постановка задачи есть непрерывный процесс, пронизывающий весь ход исследования.",
          "Важной частью постановки задачи является определение характеристик системы, подлежащей изучению. Все системы – это подсистемы других более крупных систем. По масштабам можно последовательно выделить следующие виды экономических систем: глобальные системы (вся мировая система в целом), экономические система масштаба континента, страны, региона, города, предприятия, подразделения и т.д. Внутри каждой системы следует определить характеристики системы, подлежащей изучению, и анализ потребностей той среды, для которой предназначается система. Например, в экономической системе масштаба предприятия, исследователя могут более всего интересовать такие подсистемы, как система управления предприятием, система мотивации трудовой деятельности, система маркетинговой деятельности предприятия и т.д. ",
          "Очертив цели и задачи исследования и определив границы системы, разработчик должен свести реальную систему к логической блок-схеме или статической модели. Следует построить такую модель реальной системы, которая, с одной стороны не будет столь упрощена, что станет тривиальной, а с другой – не будет столь детализирована, что станет громоздкой в обращении и чрезмерно дорогой. Р. Шеннон предостерегает: «Опасность, которая подстерегает нас при построении логической блоксхемы реально действующей системы, заключается в том, что модель имеет тенденцию обрастать деталями и элементами, которые порой ничего не вносят в понимание данной задачи. Почти всегда наблюдается тенденция имитировать избыточное число деталей, поэтому следует строить модель, ориентированную на решение вопросов, на которые требуется найти ответы, а не имитировать реальную систему во всех подробностях». Модель должна отображать только те аспекты системы, которые соответствуют задачам исследования. И далее [13, c.42] Р. Шеннон приводит очень интересную мысль: «Во многих исследованиях моделирование может на этом закончиться. В удивительно большом числе случаев в результате точного и последовательного описания ситуаций становятся очевидны дефекты и «узкие места» системы, так что необходимость продолжать исследования с помощью имитационных методов отпадает»"
        ]
      },
      {
        "path": "simulationprocess-3",
        "theme": "Формулирование модели",
        "paragraphs": [
          "Модель – представление объекта, системы или понятия (идеи) в некоторой форме, отличной от формы их реального существования. Модель – это прежде всего упрощенное представление реального объекта или явления, сохраняющее его основные, существенные черты. Сам процесс разработки модели, т.е. моделирование, может быть осуществлен различными способами, из которых наиболее распространено физическое и математическое моделирование.",
          "Разработка и построение модели социально-экономической системы требует глубокого изучения свойств исходного объекта. При этом в основе построения модели лежат, как правило, определенная теоретическая концепция, включающая способ анализа ситуации, некоторые априорные представления о взаимосвязях между наблюдаемыми и изучаемыми признаками и факторами. В начале построения модели следует по возможности точно сформулировать те предпосылки (гипотезы) и отношения, на которых базируется математическая модель объекта. В основу предлагаемого описания отношений, определяющих возможный тип модели, положена классификация",
          "Балансовые отношения реализуют равенство суммы наличных объемов (товаров, ресурсов, финансовых потоков и т.п.), полученных из различных источников, сумме объемов, использованных по различным направлениям. ",
          "Технологические отношения раскрывают и детализируют технологические процессы конкретных экономических систем. ",
          "Поведенческие отношения описывают поведение элементов экономической системы, имеющих некоторую свободу выбора решений.",
          "Структурные отношения определяют иерархию управления (взаимосвязи, соподчиненность элементов) и правила, регулирующие функционирование элементов системы в рамках этой иерархии. ",
          "Экономические отношения раскрывают взаимосвязи экономической системы с окружающей средой. ",
          "Демографические отношения учитывают влияние роста и структуры населения на производство.",
          "Экзогенные отношения описывают взаимоотношения экономической системы с элементами внешней среды, причем влияние системы на эти элементы ограниченно (внешняя торговля, стихийные бедствия и др.). ",
          "Следует иметь в виду, что при разработке моделей достаточно сложных экономических систем необходимо учитывать несколько или даже все вышеуказанные отношения элементов системы. "
        ]
      },
      {
        "path": "simulationprocess-4",
        "theme": "Оценка адекватности модели",
        "paragraphs": [
          "Какой бы сложной и полной ни была модель, она тем не менее является приближенным отображением реального объекта и отражает его при определенных принятых допущениях. Однако до тех пор пока не доказана адекватность модели реальной обстановке, нельзя с уверенностью утверждать, что с ее помощью получатся те результаты, которые действительно характеризуют функционирование исследуемого объекта. Оценка адекватности и точности математической модели любого типа, в том числе и имитационной, является важнейшей задачей моделирования, так как любые исследования на неадекватной модели теряют смысл.",
          "Р. Шеннон по этому поводу сделал следующий вывод: «Проверка модели – этап чрезвычайно важный, поскольку имитационные модели вызывают впечатление реальности, и как разработчики моделей, так и их пользователи легко проникаются к ним доверием. К сожалению, для случайного наблюдателя, а иногда и для специалиста, искушенного в вопросах моделирования, бывают скрыты исходные предположения, на основе которых строилась данная модель. Поэтому проверка, выполненная без должной тщательности, может привести к катастрофическим последствиям». ",
          "Такого процесса, как «испытание» правильности модели, не существует. Вместо этого экспериментатор в ходе разработки модели должен провести серию проверок с тем, чтобы укрепить свое доверие к модели. Оценка адекватности модели заключается в повышении до приемлемого уровня степени уверенности, с которой можно судить относительно корректности выводов о реальной системе, полученных на основании обращения к модели. ",
          "Для этого могут быть использованы проверки трех видов. При проверке первого вида следует проверить: не будет ли модель давать просто абсурдные ответы. Второй метод оценки адекватности модели называется верификацией. Верификация имитационной модели – проверка соответствия ее поведения предположениям экспериментатора. Это первый этап действительной подготовки к имитационному эксперименту. Подбираются некоторые исходные данные, для которых могут быть представлены результаты просчета. Если окажется, что ЭВМ выдает данные, противоречащие тем, которые ожидались при формировании модели, значит, модель неверна. В обратном случае переходят к следующему этапу проверки работоспособности модели – ее валидации.",
          "Валидация имитационной модели – проверка соответствия данных, получаемых в процессе машинной имитации, реальному ходу явлений, для описания которых создана модель. Состоит в том, что выходные данные после расчета на ЭВМ сопоставляются с имеющимися статистическими сведениями о моделируемой системе. ",
          "Таким образом, вопрос оценки адекватности модели имеет две стороны:",
          "- приобретение уверенности в том, что модель ведет себя таким же образом, как и реальная система; ",
          "- установление того, что выводы, полученные из экспериментов с моделью, справедливы и корректны. ",
          "С  ростом адекватности и точности модели возрастают как ее стоимость, так и ценность для исследования, в связи с чем приходится решать вопрос о компромиссе между стоимостью модели и последствиями ошибочных решений из-за неадекватности исследуемому процессу. Оценка адекватности и точности модели представляет собой непрерывный процесс, правильность построения модели может быть проверена только на практике за счет повторения цикла «построение модели – проверка модели». Следует отметить, что понятие адекватности модели не имеет количественного измерения: модель либо адекватна явлению, либо не адекватна. При этом, естественно, предполагается, что программа, реализующая вычисления по математической модели, не содержит ошибок, исходные данные введены в машину правильно. Таким образом, модель является достоверной, если ее концептуальная модель адекватна исследуемому процессу, математическая модель адекватна концептуальной, а точность реализации математической модели на ЭВМ соответствует заданной, т.е. погрешности расчета не превышают допустимых"
        ]
      },
      {
        "path": "simulationprocess-5",
        "theme": "Экспериментирование с использованием имитационной модели",
        "paragraphs": [
          "После завершения этапов разработки и планирования осуществляется процесс экспериментирования на модели с целью получения желаемой информации. На этом этапе начинают выявляться недостатки и просчеты в модели и планировании проведения экспериментов, которые должны постоянно устраняться до тех пор, пока не будут достигнуты первоначально поставленные цели. ",
          "При экспериментировании модель выступает как самостоятельный объект исследования. Одну из форм такого исследования составляет проведение модельных экспериментов, при которых целенаправленно изменяются условия функционирования модели и систематизируются данные о ее «поведении». Конечным результатом этого этапа является совокупность знаний о модели в отношении существенных сторон объекта-оригинала, которые отражены в данной модели."
        ]
      },
      {
        "path": "simulationprocess-6",
        "theme": "Механизм регламентации событий и процессов",
        "paragraphs": [
          "Поскольку в большинстве имитационных экспериментов имитируется поведение системы на некотором отрезке времени, одной из наиболее важных задач при создании модели является определение механизма регламентации событий и процессов. В имитационном моделировании понятие «регламентация» включает в себя два аспекта, или две функции: ",
          "- «продвижение» времени (корректирование временной координаты состояния системы); ",
          "- обеспечение согласованности различных блоков и событий в имитационной модели. ",
          "Поскольку действия, выполняемые различными блоками, зависят от действий и состояний других элементов, они должны быть скоординированы по времени или синхронизированы. Таким образом, функционирование модели должно протекать в искусственном времени, обеспечивая появление событий в надлежащем порядке и с надлежащими временными интервалами между ними. ",
          "Существуют два основных метода задания времени – с помощью фиксированных и переменных интервалов времени. Их иногда называют также соответственно методами фиксированного шага и шага до следующего события. По методу фиксированного временного шага отсчет системного времени ведется через заранее определенные временные интервалы постоянной длины (моделирование протекает в обычном времени с фиксированным шагом). При использовании метода переменного шага, или шага до следующего события, состояние моделируемой системы обновляется с появлением каждого существенного события независимо от интервала времени между ними (моделирование протекает во времени событий). ",
          "У каждого из этих методов есть свои преимущества. В модели, использующей метод задания шага до следующего события, обработка событий идет последовательно и время имитации каждый раз смещается вперед на начало следующего события, каждое из которых обслуживается происходит по группам или множествам событий. ",
          "Использование метода фиксированных шагов более предпочтительно, если: ",
          "- события появляются регулярно и распределены во времени относительно равномерно;",
          "- в течение цикла моделирования появляется много событий, причем математическое ожидание продолжительности событий мало;",
          "- точная природа существенных событий не ясна, как, например, это бывает на начальном этапе имитационного исследования. ",
          "С другой стороны, метод задания шага до следующего события выгоден тем, что: ",
          "- позволяет экономить машинное время в случае статических систем, в которых существенные события могут длительное время не наступать;",
          "- не требует определения величины приращения времени (что влияет и на продолжительность цикла моделирования, и на точность); ",
          "- может эффективно использоваться при неравномерном распределении событий во времени и (или) при большой величине математического ожидания их продолжительности. "
        ]
      },
      {
        "path": "simulationprocess-7",
        "theme": "Интерпретация и реализация результатов моделирования",
        "paragraphs": [
          "По мнению Р. Шеннона, никакое задание на моделирование не может считаться успешно завершенным до тех пор, пока оно не будет принято, понято и использовано. Наибольшие неудачи, постигавшие специалистов, занимающихся проблемами управления, были связаны и восприятием и использованием их работ. Роберт Шеннон следующим образом распределяет время, необходимое на проектирование и работу с моделью: 25% на постановку задачи, 20% на сбор и анализ данных, 30% на разработку модели и 25% на реализацию. Самая лучшая в мире имитационная модель ничего не стоит, пока она не использована или не одобрена теми, для кого она была разработана. Для большинства специалистов и руководителей производства интерес представляет не изящная модель и искусное использование математических методов, а реальные проблемы и способы их решения",
          "Информация, получаемая с помощью имитационной модели должна быть приемлема для заказчика или пользователя, которые должны понимать, как необходимо поступить или как можно использовать полученные результаты. Если ему не ясно, как эти данные могут помочь ему или кому-либо другому принимать решения, то он их будет просто игнорировать, и вся работа по созданию модели окажется безрезультатной.",
          "Любая имитационная модель должна позволять специалисту, работающему с ней, оценивать решения, которые удовлетворяют его собственным понятиям рациональности, а также возможные результаты сформулированных им стратегий. Пользователь модели, если он не является ее разработчиком, полагает, что именно он может наилучшим образом получать правильные решения. ",
          "Чтобы иметь максимальные шансы успешного применения результатов имитационного исследования, имитационная модель должна быть: ",
          "- понятной заказчику-пользователю; ",
          "- способной давать разумные ответы; ",
          "- способной давать информацию, которая может быть в дальнейшем использована; ",
          "- реалистичной в требованиях к данным;",
          "- способной отвечать на вопросы типа «А что будет, если…?»; ",
          "- легко модифицируемой; ",
          "- недорогой при применении. "
        ]
      },
      {
        "path": "simulationprocess-8",
        "theme": "Организационные аспекты имитационного моделирования",
        "paragraphs": [
          "Главная цель построения любой имитационной модели – помочь руководителям повысить качество управления. Для того чтобы предоставлять им нужные данные в нужной форме и в нужное время – что поможет правильно принимать нужные решения – необходимо глубоко вникнуть как в сам процесс принятия решений, так и в функции лиц, принимающих решения.",
          "Процесс управления в экономической системе можно описать как последовательность следующих фаз: планирование, организация, учет, регулирование и анализ. На первой фазе участники процесса планирования разрабатывают план будущей деятельности, на второй – происходит их взаимодействие, направленное на выполнение разработанного плана, и на последующих фазах процесса управления осуществляется учет, регулирование и анализ выполняемой деятельности как в процессе ее осуществления, так и после ее окончания. ",
          "Все фазы процесса управления в большей или меньшей степени пронизываются процессами принятия решений. Принятие решений необходимо тогда, когда нормы не определяют однозначно управляемую деятельность. ",
          "Процессом принятия решений является часть управленческой деятельности, кульминационным моментом которой является выбор из множества альтернатив возможных курсов действий. ",
          "Р. Шеннон на основе глубокого исследования теории и практики принятия решений сделал очень важный для разработчиков имитационных систем вывод о том, что существует два различных направления таких работ: ",
          "- нормативная теория принятия решений, описывающая, как нужно принимать оптимальные решения;",
          "- дискриптивная теория принятия решений, пытающаяся описать, как в действительности они принимаются. ",
          "Два различных подхода в теории и практике принятия решений могут затруднить эффективное использование метода имитационного моделирования на практике.",
          "Минимальные необходимые и достаточные условия существования ситуации принятия решений требуют наличия:",
          "- лица, принимающего решения (ЛПР), которое отдает себе отчет в том, что проблема существует, и требует принятия решения; ",
          "- выхода или цели, которых стремится достичь ЛПР;",
          "- по крайней мере двух альтернативных вариантов решения, которые направлены на достижение поставленной цели; ",
          "- сомнений ЛПР относительно того, какую из альтернатив следует предпочесть; ",
          "- среды или условий, в которых существует проблема. В этих условиях ЛПР: ",
          "- осознает необходимость принять решение; ",
          "- проводит поиск и оценку альтернативных действий; ",
          "- выбирает одну или несколько альтернатив, которые, по его мнению, ведут к достижению цели. ",
          "Результатом принятия решения может быть выполнение некоторого действия или принятие идеи. Легко предположить, что руководитель знает о существовании нерешенной проблемы, знает, какова эта проблема, имеет намерение решить ее. Однако обычно осознание наличия проблемы приходит постепенно, в процессе длительного наблюдения руководителя за управляемой им системой и обсуждения возникающих вопросов с коллегами и подчиненными. ",
          "Роберт Шеннон отмечает: «У администраторов вырабатывается скептический взгляд на необходимость проводить в жизнь рекомендуемые им решения, и поэтому они склонны не принимать во внимание проблемы, которые формулируются в недостаточно ясной и четкой форме. Помимо риска есть и другие факторы, которые способствуют отклонению предлагаемых решений. Один из таких факторов – обучение. Администраторов учат либо они сами приходят к такой мысли, что следует избегать принятия решений, в которых нет необходимости». Поскольку новые решения обычно прерывают нормальный ход работы и создают дополнительную работу, администраторы (специалисты) избегают принятия каких-либо решений",
          "Далее Р. Шеннон приводит очень жизненное, не лишенное юмора наблюдение: ",
          "«Нам всем присуще избегать самостоятельно поставленных вопросов. Принятие решений побуждается: ",
          "сверху – вышестоящим руководством, ",
          "снизу – подчиненными, ",
          "собственной инициативой. ",
          "В первом случае руководителем практически всегда принимается решение; во втором также принимается решение, хотя оно иногда может заключаться и в том, чтобы не принимать никакого решения; в третьем же случае нет подталкивающего механизма, и такие решения могут долго не приниматься без опасения каких-либо наказаний». Если принимаемое на ходу решение вызывает противоречивые последствия, руководитель может отложить детальное изучение проблемы. Он рассуждает так, что со временем положение само собой исправится и это избавит его от «управленческих мук». Боязнь принять неверное решение часто сильнее опасения возможных неблагоприятных последствий непринятия никакого решения.",
          "Аналогичный вывод делает и Стаффорд Бир: ",
          " «Главная трудность заключается в том, что управляющие далеко не наивные люди; они хорошо знают, что в действительности происходит. Глупо пытаться покровительственно инструктировать их в отношении «реальной жизни». Но они обратятся к автору, если сочтут, что он объясняет важный для них предмет». ",
          "Поэтому цели проведения имитационного эксперимента должны быть сформулированы очень точно, а их результаты должны приводить к конкретным результатам по совершенствованию работы системы. Имитационные модели должны создаваться целенаправленно для конкретных ЛПР и выдавать рекомендации в такой форме, в которой они будут целиком и полностью понятны и приемлемы для ЛПР. Чем тщательнее сформулирована проблема, чем продуманнее планирование и проведение исследования, тем легче объяснить и внедрить полученные результаты.",
          "Моделирование принятия решений обычно осуществляется в соответствии с одной из двух схем, которые можно условно назвать классической и новой.",
          "Классическая схема имеет глубокие корни в экономической науке. В ее основе лежит предпосылка абсолютной рациональности агента принятия решений. Практически она сводится к рассмотрению процесса принятия решений как акта выбора из заданного множества альтернатив, максимизирующего (минимизирующего) однозначный скалярный показатель, который и является критерием оптимальности решения",
          "В противоположность классической в основе новой схемы принятия решения лежит предпосылка ограниченной рациональности агента принятия решений. Эта схема была в основном разработана в трудах Г. Саймона. В соответствии с этой схемой принятие решений рассматривается как протяженный во времени многоэтапный процесс. Процесс этот можно представить в виде последовательности следующих этапов: сбор информации, выявление проблемы, формулирование целей, генерирование альтернатив, оценка последствий реализации альтернатив, выбор альтернатив. Характеризуя процесс принятия решений Г. Саймон указывал: « Руководящие работники и их персонал тратят большую часть времени своего времени на наблюдение за экономической, технической, политической и социальной средой для выявления новых усилий, требующих новых действий. Они, вероятно, тратят еще большую часть своего времени, индивидуально или сообща, стремясь открыть, спроектировать и разработать возможные курсы действий для ситуаций, которые требуют решения. Они тратят маленькую часть своего времени на выбор среди альтернатив действий уже разработанных применительно к выявленной проблеме и проанализированных в терминах их последствий». ",
          "При рассмотрении принятия решения только как выбора наилучшего (оптимального) решения из заранее ограниченного множества альтернатив самые важные, творческие этапы этого процесса выпадают. Оптимальность решения является производной от множества альтернатив, из которого производится выбор, а само это множество является результатом одного из важнейших этапов принятия решения. Если из предпосылки абсолютной рациональности следует, что критерием выбора альтернатив является их оптимальность, то из предпосылки ограниченной рациональности следует, что им является удовлетворительность выбранных альтернатив. Это связано с тем, что процесс принятия решения во многом является познавательным процессом, а ресурсы, в том числе временные, на такое познание всегда ограничены. Причина этого – в современном уровне знаний и в наличных материальных ресурсах, а также в личных возможностях субъектов процесса принятия решений – их способностях, усилиях, опыте и т.д. ",
          "Важнейшими чертами процесса принятия решений, по мнению Г.Саймона, является его познавательный характер и принципиально неустранимая многокритериальность выбора. ",
          "Познавательный характер процесса принятия решений проявляется в том, что он фактически представляет собой процесс устранения или уменьшения степени неопределенности решений относительно внешней и внутренней среды.Внедрение в управленческий процесс имитационных систем позволяет перенести акцент в нем с анализа произошедших событий на прогнозирования событий предстоящих. По мнению Стаффорда Бира, в процессе развития науки об управлении и процесса последнего прежде всего предпринимались усилия к тому, чтобы ускорить процесс формирования финансовой отчетности и лишь затем ускорить процесс реакции на ее итоги. С. Бир так комментирует этот процесс: «Однако история остается историей, касается ли она недавних или давно прошедших событий. Множество экономических учреждений не может разобраться с тем, что произошло, пока не пройдет несколько месяцев; даже лучшие из них вынуждены ожидать, когда данные будут получены и проанализированы. Запаздывание существует, и даже вчерашние данные или показатели только что закончившейся смены говорят нам только о том, что мы были обязаны сделать сегодня или в эту смену, хотя ясно, что уже поздно. Стоит предпринять огромные усилия, чтобы прорваться через барьер, на котором написано 'сейчас', с тем, чтобы управляющие занимались тем, чем можно управлять, а именно— будущим, каким бы близким оно не было. Это лучше, чем изучать сведения о том, чего уже нельзя исправить, а именно — прошлым, даже если оно свершилось минуту назад. Конечно, прошлое учит, но на него нельзя повлиять». ",
          "Использование методологии имитационного моделирования позволяет в известных пределах изменять тенденции по мере их формирования и подсчитать вероятность их сохранения в дальнейшем. Имитационная модель или модули поддержки принятия решений на ее основе предназначены для использования в качестве диагностического инструмента. ",
          "По мнению С. Бира, традиционно людьми, осуществляющими эксперименты, были ученые. Управляющие, как всегда считалось, не могут себе позволить экспериментирования - они рискуют жизнями людей, деньгами акционеров и будущим своего дела. Их решения могут быть ошибочными, и они могут совершать ошибки; мудрые управляющие рассматривают подобные ошибки, которые уже поздно исправлять, как эксперименты 'за неимением лучшего' и пытаются извлекать из них все полезное. Но преднамеренное, хладнокровное экспериментирование никогда раньше не практиковалось управляющими. ",
          "Сегодня благодаря моделированию на компьютерах любой тип ситуации может быть промоделирован участниками процесса. Нет никаких оснований утверждать, что результаты экспериментирования могут совершенно точно предсказать результат. Однако эксперимент позволяет исследовать реакции системы на различные альтернативные действия с тем, чтобы увидеть, какие области проблемы чувствительнее других при различных действиях, предлагаемых управляющими. Это делается с целью проверки того, какой курс действий в ряду близких событий окажется уязвимее другого. "
        ]
      }
    ]
  },
  {
    "id": "4",
    "title": "Имитационные модели глобальных систем",
    "path": "globalsystems",
    "subjects": [
      {
        "path": "globalsystems-1",
        "theme": "Основные компоненты динамической мировой модели",
        "paragraphs": [
          "В динамической мировой модели Дж. Форрестера взаимоувязаны население, капиталовложения, географическое пространство, природные ресурсы, загрязнение и производство продуктов питания. Этими основными компонентами и их взаимодействиями обуславливается динамика изменений в мировой системе. Растущее население вызывает рост индустриализации, рост потребности в продуктах питания и распространение населения по все большей территории. Но рост производства продуктов питания, промышленных товаров и занимаемой территории способствует не только поддержанию, но и увеличению количества населения. Рост населения с сопровождающими его индустриализацией и загрязнением является следствием циклических процессов, в которых каждый сектор способствует росту других секторов, и обеспечивает свое развитие за их счет. Но со временем рост наталкивается на пределы, налагаемые природой. Почва и природные ресурсы истощаются, а способность биосферы Земли разлагать загрязнения не беспредельна. Задача состоит в том, чтобы выбрать наилучший из возможных вариантов перехода от динамического роста к состоянию мирового равновесия.",
          "Модель была построена на основании ряда утверждений, наблюдений и предположений, касающихся мировой системы, в ней взаимосвязаны секторы демографии, экономики, сельского хозяйства и технологии. Модель описывает мировую систему, которая демонстрирует ряд альтернативных возможностей поведения человечества, которые оно пока еще может выбрать. "
        ]
      },
      {
        "path": "globalsystems-2",
        "theme": "Концепция «петля обратной связи»",
        "paragraphs": [
          "Решающий этап в построении машинной модели социальной системы – выбор и согласование информации о реальной системе Обычно испытываются трудности не в нехватке информации, а в ее избытке и в необходимости избирательного подхода к ней. Разнородная информация должна быть организована. ",
          "Важной концепцией в установлении структуры системы является идея, что все изменения обуславливаются «петлями обратных связей». Петля обратной связи – это замкнутая цепочка взаимодействия, которая связывает исходное действие с его результатом, изменяющим характеристики окружающих условий и которые, в свою очередь, являются «информацией», вызывающей дальнейшие изменения. Мы часто рассматриваем причину и следствие односторонне. Мы говорим, что действие А вызывает результат В. Но такое понимание неполно. Результат В представляет новое состояние системы, изменение которой в будущем повлияют на действие А. Все процессы роста и стабилизации генерируются петлями обратных связей. ",
          "В системе с петлями обратных связей введены два типа переменных - уровни и темпы. Уровни – это накопители системы. Темпы – потоки, вызывающие изменение уровней. Уровень аккумулирует общее количество, являющееся результатом «впадающих» в него темпов, которые прибавляются или вычитаются из уровня. Системные уровни полностью описывают положение или состояние системы в любой момент времени. Уровни существуют во всех подсистемах – финансовой, физической, биологической, психологической и экономической. Население, как создающееся в результате аккумуляции «чистой» разности между темпом рождаемости и темпом смертности, рассматривается как уровень мировой системы. Изменение уровней вызывается соответствующими темпами потоков. Темп потока контролируется только одним или несколькими системными уровнями, но не другими темпами. Все системы, которые изменяются во времени, могут быть представлены как конструкции уровней и темпов, эти два типа переменных не только необходимы, но и достаточны для понимания любой системы. ",
          "В качестве основных уровней, на которых строится структура системы Дж. Форрестера, было выбрано пять следующих уровней:",
          "- население;",
          "- капиталовложения; ",
          "- природные ресурсы; ",
          "- часть капиталовложений, вкладываемых в сельское хозяйство; ",
          "- уровень загрязнения. ",
          "Верхняя петля определяет темп рождаемости, который увеличивает население. Нижняя петля определяет темп смертности, уменьшающий население. Темп рождаемости и темп смертности определяются количеством людей, родившихся и умерших за год. Они определяют общий темп изменения численности населения. Разность этих величин составляет чистый прирост населения. Эти темпы принято считать «нормальными», если они соответствуют стандартной системе мировых условий, когда величины уровня питания, материального уровня жизни, плотности и загрязнения соответствуют своим «стандартным» значениям. Однако эта же система переменных при других численных значениях может вызвать рост или падение темпов рождаемости и смертности по сравнению с их нормальными значениями. Влияние жизненных условий в мировой системе Форрестера описывается посредством «множителей», которые увеличивают или уменьшают нормальные темпы системы в зависимости от того, насколько благоприятно их воздействие в данный конкретный момент времени. Изменение этих множителей, отражающих текущее состояние мировой системы (уровень питания, материальный уровень жизни, плотность населения и уровень загрязнений) может вызывать рост населения, его стабилизацию или уменьшение.",
          "Петля рождаемости – положительная обратная связь, вызывающая рост населения. Увеличение населения вызывает рост темпа рождаемости (число людей, родившихся в системе в течение года), который в свою очередь увеличивает население. Если бы не было сдерживающих сил, то население экспоненциально возрастало бы за счет влияния положительных обратных связей. Но петля смертности - отрицательная. Когда население растет, количество умирающих в год также возрастает. Увеличение населения увеличивает темп смертности, что ведет к уменьшению населения."
        ]
      },
      {
        "path": "globalsystems-3",
        "theme": "Основные петли «обратных связей» в мировой модели",
        "paragraphs": [
          "Используя концепцию петель обратных связей, разработчик модели должен установить значимые зависимости между основными переменными в системе. В модели Форрестера заложены следующие логические цепочки положительных и отрицательных обратных связей мировой модели. ",
          "Капиталовложения. Генерация капиталовложений зависит от численности населения и нормальной генерации капиталовложений. Но множитель капиталовложений изменяет нормальный темп создания фондов. При очень низких значениях материального уровня жизни мотивы для потребления всей создаваемой продукции столь сильны, что накопление капитала может быть очень мало. При очень высоких значениях относительной величины фондов на душу населения падают потребности и стимулы к еще большему увеличению материального уровня жизни. ",
          "Загрязнение. Еще одна петля положительной обратной связи (вместе с отрицательной петлей) существует в секторе загрязнения. Отрицательная обратная связь представляет собой основной процесс разложения загрязнения. Чем выше уровень загрязнения в некоторый момент времени, тем большее его количество может разлагаться в единицу времени – до тех пор, пока уровень загрязнения не возрастет настолько, что будет разрушать природные процессы самоочищения. Объединение двух петель может давать либо отрицательный, либо положительный эффект в зависимости от величины загрязнения. Если общее загрязнение становится настолько большим, что подавляет природные процессы самоочищения, происходят крупномасштабные катастрофы. ",
          "Рост населения. На темпы рождаемости и смертности оказывают влияние такие факторы, как плотность населения, обеспеченность пищей, загрязнение, наличие природных ресурсов. При помощи концепции петель обратной связи можно установить взаимное влияние этих параметров на рост населения. ",
          "Ресурсы. Растущее население использует природные ресурсы до тех пор, пока падение материального уровня жизни не вызовет очередного уменьшения численности населения. Если население растет, то темп потребления природных ресурсов повышается, что приводит к истощению природных ресурсов, их запасы уменьшаются. Это, в свою очередь, понижает эффективность относительной величины фондов и материальный уровень жизни. Падение материального уровня жизни вызывает увеличение темпа рождаемости, но это увеличение компенсируется ростом темпа смертности и уменьшает численность населения. Здесь одна из петель – положительная, а другая – отрицательная. "
        ]
      },
      {
        "path": "globalsystems-4",
        "theme": "Основные переменные в мировой модели",
        "paragraphs": [
          "В этом подразделе более подробно рассмотрены некоторые переменные мировой модели Дж. Форрестера. ",
          "Население. Население в мировой модели представляет собой переменный уровень системы. Население в любой момент времени вычисляется как население в предшествующий момент времени, плюс население, которое добавляется за счет темпа рождаемости в охватываемый период, минус население, убывающее за счет смертности. В математической модели уровень «население» представляет собой вычислительную процедуру, разворачивающуюся в сторону возрастания времени, при этом его значение увеличивается или уменьшается в соответствии с темпами потоков.",
          "Темп рождаемости. Темп рождаемости зависит от численности населения и значения нормального темпа рождаемости, иными словами, темп рождаемости есть темп увеличения населения, он измеряется количеством родившихся за год. Реальный темп рождаемости не может рассматриваться как постоянная величина на протяжении сколько-нибудь длительного периода времени. Он зависит, в частности, от фондов и природных ресурсов, поскольку эти переменные влияют на материальный уровень жизни, плотность населения, обеспеченность пищей и уровень загрязнения. Такого рода влияния со стороны других частей системы вводятся множителями, которые модифицируют базисный темп рождаемости. При нормальных условиях множители не должны изменять базисный темп рождаемости, т.е. они равны 1. Если условия оказываются более благоприятными, чем нормальные, то множитель должен быть больше 1, если менее – то меньше 1. ",
          "Материальный уровень жизни. Материальный уровень жизни есть безразмерная величина, которая описывает степень изменения эффективности относительной величины фондов на душу населения в сравнении с ее начальным значением на год разработки модели. Его значение определяется как отношение эффективности относительной величины фондов (на душу населения) к нормальной эффективности относительной величины фондов. Единица фондов в модельной системе определяется как количество фондов на душу населения на начальный год. ",
          "Природные ресурсы – системный уровень. Он связан только с одним потоком, уменьшающим его темпом потребления. В мировой модели Форрестера природные ресурсы включают в себя только невосполнимые ресурсы и не включают, например, лес и другие ресурсы, которые могут возобновляться; последние классифицируются как часть сельскохозяйственного сектора. ",
          "Темп использования природных ресурсов определяется произведением следующих сомножителей: численностью населения, нормальным потреблением природных ресурсов и множителем зависимости добычи природных ресурсов от материального уровня жизни, который растет, когда возрастает уровень жизни. ",
          "Темп смертности вводится в модель аналогично темпу рождаемости и корректируется при помощи ряда множителей: зависимости темпа смертности от материального уровня жизни, загрязнения, уровня питания, плотности населения. ",
          "Относительный уровень питания. Относительный уровень питания определяет количество пищи на душу населения и представляет собой частное от деления значения пищевого потенциала фондов на нормальный уровень питания, умноженный на три множителя: зависимости производства продуктов питания от плотности населения, от уровня загрязнения и от коэффициента питания. При нормальных условиях эти множители равны 1, более или менее благоприятные условия должны соответственно вызывать изменения в значении уровня питания на душу населения.",
          "Относительная величина фондов в сельском хозяйстве. Количество пищи на душу населения предполагается зависящим от количества фондов на душу населения в сельском хозяйстве, ее величина определяется как относительная величина фондов (фондовооруженность), умноженная на часть фондов в сельском хозяйстве и разделенная на нормальную часть фондов в сельском хозяйстве. Фондовооруженность является относительной величиной, определяет количество единиц фондов на душу населения и измеряется в единицах количества фондов на душу населения по отношению к начальному году моделирования. ",
          "Фонды – один из системных уровней. Этот уровень образуется за счет накопления капиталовложений (фондообразования) и за счет уменьшения фондов вследствие их износа. ",
          "Помимо перечисленных в модели используются десятки переменных."
        ]
      },
      {
        "path": "globalsystems-5",
        "theme": "Структура модели мировой системы",
        "paragraphs": [
          "Как было сказано, модель мировой системы Дж. Форрестера связывает воедино пять уровней переменных – население, природные ресурсы, капиталовложения, фонды в сельском хозяйстве и загрязнение. Подробная схема мировой модели приведена в книге ее автора.",
          "Каждый из уровней моделей включает в себя положительную и (или) отрицательную петлю обратной связи, определяющую темп изменения уровня. Для уровня населения положительная петля определяет темп рождаемости, отрицательная – темп смертности. Для уровня капиталовложений две петли обратных связей описывают регулирующие воздействия на капиталовложения. Аналогично вводится в модель взаимодействие прочих уровней и темпов. ",
          "Все уровни и переменные так или иначе оказывают взаимное влияние друг на друга, что учитывается в модели при помощи множителей. Следует отметить, что множители в модели в свою очередь являются функциональными зависимостями, описывающими влияние одних переменных на другие. Например, изменение темпа рождаемости в зависимости от других переменных определяется множителем зависимости темпа рождаемости от плотности населения, множителем зависимости темпа рождаемости от относительного уровня питания, множителем зависимости темпа рождаемости от загрязнения, множителем зависимости темпа рождаемости от уровня жизни и т.п. Эти зависимости устанавливаются или при помощи выдвижения гипотез, или при помощи анализа предыдущих наблюдения над развитием мировой системы, или экспериментальным путем. "
        ]
      },
      {
        "path": "globalsystems-6",
        "theme": "Основные результаты экспериментов на модели мировой системы",
        "paragraphs": [
          "Элементы модели, описанной в предыдущем разделе, определяют правила взаимодействия между ними. Эти правила предписывают, каким именно образом каждый блок системы функционирует под влиянием других блоков. Имитационная модель мировой системы представляет некоторую информацию о реальном мире. Эта информация складывается из двух частей – информации о поведении какого-то элемента системы или всей системы в целом. При проведении моделирования разработчиков модели прежде всего интересовало ее поведение при возникновении противоречий между экспоненциальным ростом уровней системы и фиксированными окружающими условиями.",
          "Предполагается, что достаточно хорошо известны причины, вызывающие рост народонаселения и экономики. Известны более или менее точно физические пределы и естественные ресурсы планеты и предельно допустимый уровень загрязнения. Дж. Форрестер ставит вопрос: « Но что произойдет, когда рост экономики и народонаселения приблизится к фиксированным природой пределам и сменится неустойчивой формой равновесия?» Очевидно, что экспоненциальный рост населения не беспределен, вопрос состоит только в том, когда и как он прекратится, а не в том, прекратится ли оно вообще. Мировая модель Форрестера содержит четыре параметра, способных ограничить рост населения – это истощение природных ресурсов, увеличение уровня загрязнения, перенаселенность, нехватка продуктов питания. При экспериментировании было проанализировано воздействие этих параметров на рост численности населения и исследованы различные виды равновесия, которые могли бы быть созданы путем проведения соответствующих мероприятий.",
          "Проведение экспериментов на модели позволило определить сценарии развития перечисленных ниже видов кризисов. ",
          "Истощение природных ресурсов. При достижении населением своей максимальной численности начнется процесс убывания численности населения, вызванный истощением природных ресурсов. Расчеты показывают, что при сохранении существующих темпов ресурсов может анализ мировой системы часто основывался на сравнении существующего положения с ее предельными возможностями. При таком подходе сиюминутные потребности кажутся значительно меньшими в сравнении с имеющимися запасами ресурсов, но при этом упускаются из вида два фактора. Во-первых, потребности человечества возрастают в два раза каждые 20-30 лет; во-вторых, последствия начинающегося кризиса начинают проявляться значительно раньше, чем достигается сама кризисная ситуация. ",
          "Кризис загрязнения. В одном из экспериментов с моделью было сделано предположение, что скорость использования естественных ресурсов была резко снижена, например, в результате достижений научнотехнического прогресса и перехода на новые технологии. В этом случае в системе возникает другая сила, подавляющая рост – развивающийся кризис загрязнения, которое резко возрастает, когда скорость загрязнения превышает скорость природных механизмов очистки.",
          "Проблема перенаселения. Следующим этапом экспериментирования с моделью явилось предположение, что человечеству удастся справиться с проблемой загрязнения. В этом случае первоначально будет происходить экспоненциальное увеличение численности населения. Но постепенно все более и более начинают проявляться сдерживающие факторы роста. Возрастающие перенаселенность, спрос на продукты питания и необходимость использовать менее продуктивные для сельского хозяйства земли приводят к дополнительным капиталовложениям в производство продуктов питания. Кризис перенаселения по результатам моделирования не носит нарастающего характера, который наблюдался для случая загрязнения. ",
          "Уменьшение относительного уровня питания. В ряде вычислительных экспериментов не учитывалось влияние плотности населения. В этом случае фактором, ограничивающим рост численности населения, становится недостаток продуктов питания. Со снижением материального уровня жизни произойдет падение относительного уровня питания, что сдерживает рост численности населения. ",
          "Несмотря на вероятность развития мировой системы со столь негативными итогами, результаты экспериментов позволили сделать вывод, что глобальное равновесие системы в принципе возможно. Результатом имитационных экспериментов с моделью являлось не точные рекомендации по планированию развития человеческой цивилизации, а привлечение внимания к исследованиям динамики ее роста и развития. ",
          "Джей Форрестер подчеркивает, что результаты моделирования не следует воспринимать как точное предсказание пути развития сегодняшнего мира, напротив, их надо принимать как одно из возможных поведений мировой системы. Конечно, сами по себе опасности возникновения тех или иных катастрофических последствий для населения планеты прогнозировались давно. Однако, моделирование этих процессов позволяет выработать стратегию развития с целью наилучшего поведения в постоянно меняющихся условиях развития мировой системы. "
        ]
      }
    ]
  },
  {
    "id": "5",
    "title": "Экономическая система масштаба предприятия как объект моделирования",
    "path": "enterprisescaleeconomicsystem",
    "subjects": [
      {
        "path": "enterprisescaleeconomicsystem-1",
        "theme": "Целесообразность использования имитационных моделей в управлении предприятием",
        "paragraphs": [
          "По наблюдениям Дж. Форрестера, при моделировании индустриальных структур часто выявляются их неожиданные свойства. Довольно часто предприятия испытывают те или иные трудности, например, падение стоимости акций, низкая рентабельность, неполная занятость и др. Первым шагом для того, чтобы понять причины такого положения, обычно служит обсуждение руководителями и специалистами тех мер, которые принимаются для решения проблемы. Обычно эти люди правильно понимают свои непосредственные трудности, знают, чего хотят добиться. Во встретившихся с трудностями компаниях сотрудники, обычно, добросовестно и в меру своих сил стараются решить главные проблемы, разрабатывают мероприятия, которые, по их мнению, помогут преодолеть трудности. Однако опыт показывает, что часто эти мероприятия приводили лишь к ухудшению положения. Фактически компания попадает в заколдованный круг, в котором направленные на спасение меры лишь усугубляют трудности; это заставляет более решительно действовать в выбранном направлении и дела идут еще хуже. За ухудшением положения следует умножение ухудшающих положение усилий",
          "Это объясняется тем, что интуитивно очевидные «решения» экономических и социальных проблем имеют тенденцию заводить в одну из ловушек, обусловленных характером сложных систем. Прежде всего, попытка отреагировать на часть симптомов может только создать новую форму поведения системы, также ведущую к неприятным последствиям. Во-вторых, попытка добиться кратковременного улучшения может привести к трудностям в долговременном плане. В-третьих, локальные цели для предприятия нередко находятся в противоречии с его интересами в целом. В четвертых, часто пытаются воздействовать на систему в тех ее частях, где она малочувствительна к такому воздействию и где усилия и деньги тратятся с малым эффектом. ",
          "Создание имитационных моделей и проведение имитационных экспериментов позволяет рассмотреть все возможные последствия тех или иных решений, произвести сравнение различных альтернативных вариантов и выбрать из них наиболее оптимальный."
        ]
      },
      {
        "path": "enterprisescaleeconomicsystem-2",
        "theme": "Каноническая модель экономической системы масштаба предприятия",
        "paragraphs": [
          "При анализе собранной информации и построения сценария функционирования объекта в первую очередь строят его каноническую модель, то есть модель, характеризующую взаимодействие объекта с окружением через входы и выходы. Для этого, прежде всего, выявляют границы между объектом и внешней средой (т.е. определяют понятие «исследуемый объект») и между внешней средой и окружением. Для исследуемой системы (процесса) окружение есть множество всех объектов вне системы, изменение характеристик которых влияет на систему или (и) характеристики которых изменяются вследствие поведения системы. Таким образом, окружение есть учитываемая при исследовании часть внешней среды.",
          "Основными типами входов являются: ",
          "x1 - информационный канал, управляющий действием объекта или подлежащий переработке объектом, ",
          "x2 - энергетический вход, обеспечивающий развитие объекта или его поддержание на заданном уровне производительности; ",
          "x3 - материальный вход, представляющий собой поток материальных средств, подлежащих переработке объектом либо потребляемых в процессе его функционирования;",
          "x4 - кадровый вход, обеспечивающий объект подготовленными для участия в процессе функционирования кадрами.",
          "Указанные входы представляют собой организованные входы, их наличие обеспечивается целеустремленной деятельностью людей. Помимо организованных входов есть неорганизованные, как правило, затрудняющие деятельность системы входы, - возмущения, поступающие из окружения (срывы сроков поставки материалов, несоответствие марки материала и т.д.), которые также могут быть классифицированы по этим четырем типам.",
          "Результат деятельности системы – вектор выхода может быть охарактеризован аналогичными составляющими:",
          "w1 - информационный выход, характеризующий результат информационной деятельности системы, ",
          "w2 -  энергетический выход, характеризующий передачу энергии от системы в окружающую среду и отход элементов системы (по выработке их ресурса, несоответствию требований или дефекта);",
          "w3 - материальный выход, характеризующий материальный результат целенаправленного действия системы (то, что система произвела), а также отходы сырья и материалов; ",
          "w4 - кадровый выход, характеризующий движение (выбытие) кадров;",
          "wв - выход-возмущение, характеризующий побочные действия объекта на окружение (в свою очередь также может быть подразделен на информационный, энергетический, материальный и кадровый).",
          "Такой набор составляющих входов и выходов обычно перечисляется в литературе периода плановой экономики. В условиях же рыночной экономики важнейшими являются следующие составляющие модели: ",
          "x5 - финансовый вход, отражающий поступление финансовых потоков в систему, ",
          "w5 - финансовый выход, отражающий движение финансовых потоков, исходящих с предприятия. ",
          "Деятельность предприятия можно рассматривать как движение и взаимозависимость финансовых и материальных потоков. На основе описания этих потоков можно создавать математические и компьютерные модели предприятий различного типа. "
        ]
      },
      {
        "path": "enterprisescaleeconomicsystem-3",
        "theme": "Ограничения, накладываемые внутренними параметрами системы на входные параметры",
        "paragraphs": [
          "Изображенный на рис.5.2. вид модели принято называть моделью типа «черного ящика». Под этим подразумевается, что известны входные параметры и при моделировании определяются выходные. При этом остается неизвестным, что происходит внутри системы с ее внутренними параметрами. Однако при моделировании экономической системы масштаба предприятия не все входные параметры могут быть выбраны произвольно, на них могут накладывать ограничения внутренние параметры системы.",
          "Все входные параметры модели системы по виду связи с ее внутренними параметрами можно разделить на два вида: ",
          "- входные параметры, имеющие ограничения, не зависящие от внутренних параметров системы; ",
          "- входные параметры, значения и ограничения которых зависят от внутренних параметров системы. ",
          "К параметрам первого вида относятся, например, такие нормативные параметры, как размеры налоговых ставок, требования стандартов и т.д. На входные параметры второго вида в той или иной степени накладывают ограничения или влияют на их значения внутренние параметры системы. Ниже приведены примеры таких ограничений, принимаемые при составлении математической модели предприятия. "
        ]
      },
      {
        "path": "enterprisescaleeconomicsystem-4",
        "theme": "Преобразование технологических параметров внутри имитационной модели системы",
        "paragraphs": [
          "На этапе детализации связей между параметрами внутри канонической модели экономической системы масштаба предприятия уточняются и конкретизируются назначение каждого элемента, функции, которые он выполняет в процессе работы всей системы, его входы и выходы – промежуточные параметры и переменные состояния объекта. По сути, повторяется процесс построения канонической модели для каждого элемента модели внутренней структуры, после чего требуется согласовать входы и выходы элементарных канонических моделей между собой и со входами и выходами канонической модели объекта в целом. При этом должны соблюдаться обязательные правила:",
          "- выход любого элемента должен быть либо входом другого элемента, либо выходом объекта, выделенным канонической моделью; ",
          "- вход любого элемента должен быть либо выходом другого элемента, либо входом элемента окружения, выделенным канонической моделью;",
          "- каждый вход канонической модели должен являться входом какоголибо элемента модели внутренней структуры; ",
          "- каждый выход канонической модели должен являться выходом какого-либо элемента модели внутренней структуры. ",
          "Для экономической системы масштаба предприятия одним из наиболее важным этапом создания модели является выявление преобразований входных технологических параметров внутри имитационной модели и определение количественных показателей выходных параметров. ",
          "Деятельность предприятия можно рассматривать как движение и взаимозависимость финансовых и материальных потоков. На основе описания этих потоков можно создавать математические и компьютерные модели предприятий различного типа.",
          "Однако, если описание финансовых потоков незначительно зависит от вида технологических процессов на предприятии, то описания материальных потоков для предприятий различной отраслевой принадлежности крайне разнообразны. В первую очередь, вид модели зависит от длительности протекания производственных процессов. ",
          "В качестве примера, сравним два вида предприятий – комбинат по переработке зернопродуктов и птицефабрику. Технологические процессы этих предприятий отличаются прежде всего длительностью своего протекания. Так, если получение муки или крупы из зерна осуществляется за несколько десятков секунд, то полный цикл производства на птицефабрике может продолжаться до полутора-двух лет, а с учетом производства племенной птицы и более. Поэтому для первого процесса достаточно создать статическую модель технологических процессов, для второго необходимо создание динамической модели. ",
          "Для описания технологических процессов обычно используются технологические карты – схематические модели, отображающие логическую последовательность операций в сжатой форме и показывающие шаг за шагом ход того или иного процесса. ",
          "После уяснения порядка выполнения технологических процессов можно приступить к составлению их математических моделей. В математической модели системы взаимосвязи между элементами задаются в виде функциональных зависимостей между количественными переменными. "
        ]
      },
      {
        "path": "enterprisescaleeconomicsystem-5",
        "theme": "Моделирование затрат на функционирование системы масштаба предприятия",
        "paragraphs": [
          "В условиях рыночной экономики практически любая оценка успешности деятельности предприятия сводится к экономическим показателям. Для получения обобщающих экономических показателей всей экономической системы в целом в ее модели должны быть сформированы математические описания распределения всех затрат по отдельным подсистемам – центрам формирования затрат в соответствии с принятой на предприятии учетной политикой. Центры формирования затрат (ЦФЗ) могут соответствовать номенклатуре технологических процессов или структурной схеме подразделений предприятия.",
          "Распределение затрат осуществляется в соответствии с принятыми в учетной политике предприятия принципами, а для вновь проектируемых систем – с принципами управленческого учета. Например, одним из возможных принципов распределения постоянных затрат предприятия является их распределение пропорционально заработной плате работников соответствующих ЦФЗ. "
        ]
      },
      {
        "path": "enterprisescaleeconomicsystem-6",
        "theme": "Определение налоговых отчислений и выходных параметров системы",
        "paragraphs": [
          "Итоговыми выходными параметрами стоимостной имитационной модели предприятия являются, как правило, доход от реализации, прибыль, рентабельность. Налоговые отчисления полностью могут быть определены также только после определения этих параметров. "
        ]
      }
    ]
  },
  {
    "id": "6",
    "title": "Использование имитационного моделирования в управлении предприятием",
    "path": "enterprisemanagement",
    "subjects": [
      {
        "path": "enterprisemanagement-1",
        "theme": "Использование имитационного моделирования для стратегического и тактического планирования",
        "paragraphs": [
          "В классических трудах по имитационному моделированию этот метод прикладного системного анализа определяется как наиболее мощный инструмент исследования сложных систем, управление которыми связано с принятием решений в условиях неопределенности. По сравнению с другими методами имитационное моделирование позволяет рассматривать большое число альтернатив, улучшать качество управленческих решений и точнее прогнозировать их последствия. Однако практическое применение этого метода в современной российской экономике остается в настоящее время достаточно редким",
          "Это можно объяснить, в частности тем, что несколько десятилетий назад, когда были заложены основы метода, уровень развития компьютерной техники был несопоставим с нынешним. Проведение имитационного эксперимента подразумевало создание специального человеко-машинного комплекса, результатом деятельности которого являлось получение необходимых результатов после проведения процесса имитации деятельности какой-либо экономической системы, после чего предполагалось построение выводов по полученным данным, их интерпретация и реализация. Этапы создания и использования модели подразумевали практически разовое ее использование для проведения того или иного эксперимента, хотя этапы стратегического и тактического планирования указывались как основные этапы процесса имитации. ",
          "В настоящее время использование на большинстве предприятий имеется в той или иной степени развитая автоматизированная информационная система. Однако в первую очередь автоматизируется работа бухгалтерских, складских, торговых и т.п. отделов и служб. В то же время процесс работы плановых служб является, как правило, разобщенным, малопроизводительным и недостаточно достоверным. Попрежнему, большинство плановиков считает план совокупностью принимаемых независимо друг от друга решений, поэтому план предприятия остается комплектом планов, подготовленных автономно для каждого структурного подразделения. И хотя управление организации формально осуществляется сверху вниз, планирование происходит снизу вверх путем составления и обобщения разрозненных планов подразделений. Процесс составления даже годового плана обычно занимает несколько месяцев и, как правило, до окончания периода действия плана коррективы в него уже не вносятся, несмотря на постоянные изменения условий функционирования организации. ",
          "Создание имитационной модели предприятия для целей автоматизации процессов стратегического и оперативного планирования и управления позволяет коренным образом изменить всю систему управления. Как правило, все расчеты специалистов при составлении планов могут быть алгоритмизированы, что позволяет «видеть» картину функционирования предприятия на требуемый срок и мгновенно вносить коррективы по окончании периода, изменении значимых параметров, а также принимать решения на альтернативной основе. ",
          "Наиболее целесообразно применение имитационных систем в тех отраслях, где технологические процессы характеризуются значительной продолжительностью: растениеводстве, животноводстве, строительстве, так как здесь наиболее велики риски финансовых потерь из-за недоучета тех или иных значимых параметров."
        ]
      },
      {
        "path": "enterprisemanagement-2",
        "theme": "Содержание процессов стратегического и тактического планирования",
        "paragraphs": [
          "Процесс планирования является центральным звеном в системе управления. Однако содержание этого звена в значительной степени зависит от принятой на предприятии системы планирования, используемых при этом методиках и технологиях. ",
          "Р. Акофф замечает: «Большинство плановиков считает план совокупностью принимаемых независимо друг от друга решений для набора проблем (опасностей и возможностей). Поэтому план корпорации видится им как комплект планов, подготовленных автономно для каждой части этого целого». Это приводит к составлению планов, не всегда ведущих к улучшению производственных и финансовых результатов работы фирмы. Может быть, поэтому в качестве эпиграфа к одной из глав своей книги Р.Акофф выбрал шутливый афоризм А. Бирса: «Планировать – хлопотать по поводу наилучшего метода получения случайного результата». ",
          "Ниже приведено более серьезное определение. ",
          "Планирование – форма управленческой деятельности, заключающаяся в подготовке различных вариантов управленческих решений в виде прогнозов, проектов программ и планов, обосновании их оптимальности, обеспечение возможности выполнения и проверки их выполнения. ",
          "Р.Акофф сделал следующее наблюдение: «Большинство плановиков и тех, кто использует планы полагают, что главную пользу приносит продукт планирования – план», и не соглашается с этой точкой зрения. По его мнению, важнейшим продуктом планирования является сам процесс. Поэтому главные выгоды дает участие в нем: «Именно благодаря участию в планировании члены организации могут развивать себя. Кроме того, участие позволяет им приобрести понимание организации и служить ее целям более эффективно. Это в свою очередь облегчает развитие организации». ",
          "Далее Р. Акофф поднимает вопрос о надлежащей роли внутренних и внешних профессиональных плановиков и плановых подразделений организации, для которой составляются планы. Их задача – стимулировать, облегчать планирование другими для себя. Профессионалы должны обеспечивать мотивы, информацию, знание, понимание, мудрость и воображение, необходимые, чтобы планировать для себя. При этом должно соблюдаться выполнение нескольких принципов. ",
          "Принцип непрерывности. Чаще всего планирование бывает не непрерывным. Например, многие компании разрабатывают пятилетние планы и освежают их раз в год. Когда план утвержден, планирование приостанавливается до следующего такого периода. Такой цикл «снова начать – снова закончить» повторяется ежегодно. ",
          "Из-за событий, которые не были и не могли быть предусмотрены, ни один план, как бы тщательно он ни был подготовлен, не выполняется так, как ожидалось. Поэтому результаты, ожидавшиеся от выполнения плана, и предпосылки, на которых основывались подобные ожидания, постоянно пересматриваются. ",
          "Принцип холизма",
          "Этот принцип состоит из двух частей: принципа координации и принципа интеграции. ",
          "Принцип координации устанавливает, что деятельность ни одной части организации нельзя планировать эффективно, если делать это независимо от остальных единиц данного уровня. Следовательно, деятельность единиц одного уровня следует планировать одновременно и во взаимосвязи. ",
          "Принцип интеграции устанавливает, что планирование осуществляемое независимо на каждом уровне, не может быть столь же эффективным, как планирование во взаимозависимости на всех уровнях. Общеизвестно, например, что стратегия или практика, сформировавшиеся на одном уровне корпорации, часто создают проблемы для других уровней.",
          "Осуществление этих принципов при отсутствии систем автоматизации процессов планирования и поддержки принятия управленческих решений было весьма затруднительно. Развитие компьютерной техники и методологии имитационного моделирования позволяет воплотить их в повседневную практику стратегического и тактического планирования. ",
          "Стратегическое планирование – вид планирования, состоящий в разработке стратегических решений, предусматривающих выдвижение таких целей и стратегий поведения соответствующих объектов управления, реализация которых обеспечивает их эффективное функционирование в долгосрочной перспективе. ",
          "Круг задач стратегического планирования связан с задачами анализа, предназначенными для выработки стратегических управленческих решений развития бизнеса. Уровень стратегического планирования ориентирован на руководителей высшего ранга. Основными целями стратегического уровня являются: ",
          "- определение системы приоритетов развития организации,",
          "- оценка перспективных направлений развития организации,",
          "- выбор и оценка необходимых ресурсов для достижения поставленных целей.",
          "При разработке модулей стратегического планирования следует учитывать:",
          "- особенности развития рыночных отношений в стране; ",
          "- возможные перспективные виды продукции (товары и услуги), относящиеся к профилю деятельности организации или предприятия;",
          "- потенциальные виды производственных ресурсов, возможные для использования при создании новых видов продукции (товаров, услуг);",
          "- перспективные технологические процессы изготовления новых видов продукции (товаров и услуг). ",
          "Отличительной особенностью модулей стратегического планирования следует решать решающую роль управленческого персонала в процессе принятия решений. Высокий уровень неопределенности и неполноты информации повышает значение субъективного фактора как основы принятия решений. Информационные технологии поддержки стратегического уровня принятия решений, основанные на методах и идеологии имитационного моделирования, помогают высшему звену управления организацией решать неструктурированные задачи, основной из которых является сравнение ",
          "Следующий круг задач управления ориентирован на выработку тактических решений. Тактический уровень принятия решений основан на разработке и работе моделей, помогающих решать отдельные, в основном слабо структурированные задачи (например, принятие решений об инвестициях, рынках сбыта и т.д.). К числу основных целей тактического руководства относятся: ",
          "- обеспечение устойчивого функционирования организации в целом; ",
          "- создание потенциала для развития организации; ",
          "- создание и корректировка базовых планов. ",
          "Тактический уровень принятия решений средним управленческим звеном используется для мониторинга (постоянного слежения), контроля принятия решений и администрирования. Одним из инструментальных средств для принятия тактических решений в настоящее время являются системы поддержки принятия решений, которые обслуживают частично структурированные задачи, результаты которых трудно спрогнозировать заранее. Основными характеристиками таких систем являются:",
          "- возможность решения проблем, развитие которых трудно прогнозировать; ",
          "- наличие инструментальных средств моделирования и анализа; ",
          "- возможность легко менять постановки решаемых задач и входных данных;",
          "- гибкость и адаптируемость к изменению условий; ",
          "- технология, максимально ориентированная на пользователя."
        ]
      },
      {
        "path": "enterprisemanagement-3",
        "theme": "Основные модули компьютерной системы поддержки принятия управленческих решений с использованием методологии имитационного моделирования",
        "paragraphs": [
          "Компьютерная система поддержки принятия управленческих решений должна позволять не только автоматизировать стандартные процессы составления планов, но и иметь возможность «проигрывания» различных вариантов, чтобы иметь возможность оценки большого количества альтернативных вариантов развития системы и выбора наилучшего из них. ",
          "Такая система, как минимум, должна включать в себя следующие основные модули: модуль нормирования, модуль технологических процессов, модуль текущего состояния системы и заданий на производство и реализацию, модуль определения затрат и движения денежных средств, модуль итогов деятельности экономической системы. ",
          "Модуль нормирования предназначен для ввода всех основных нормативных показателей, на основе которых разрабатываются производственные и финансовые планы предприятия. Следует учитывать, что и сами нормы могут являться входными параметрами, изменение значений которых исследуется в ходе составления планов на многоальтернативной основе.",
          "Модуль технологических процессов служит для описания зависимостей между входными и выходными параметрами всех технологических процессов, осуществляемых на предприятии. Этот модуль является основой для планирования необходимых ресурсов, объемов выпускаемой продукции и определения ее себестоимости, планирования объемов реализации и т.п. "
        ]
      }
    ]
  },
  {
    "id": "7",
    "title": "Статистическое имитационное моделирование",
    "path": "statisticalsimulation",
    "subjects": [
      {
        "path": "statisticalsimulation-1",
        "theme": "Метод Монте-Карло",
        "paragraphs": [
          "Имитационное моделирование, при котором воспроизводятся случайные явления, называется статистическим имитационным моделированием. Случайные факторы при построении компьютерной модели имитируются при помощи случайных чисел, формируемых ЭВМ. Таким образом, под статистическим имитационным моделированием понимают построение имитационной модели существующего или гипотетического (предполагаемого, разрабатываемого) объекта, учитывающей случайные явления, и проведение экспериментов на этой модели. Статистическое имитационное моделирование (СИМ) базируется на численном статистическом методе решения математическим задач, называемых методом Монте-Карло. Часто статистическое имитационное моделирование просто отождествляют с этим методом.",
          "Использование СИМ позволяет моделировать любые объекты, в том числе социально-экономические, с учетом большого числа факторов, при практически любых законах распределения случайных входных параметров.",
          "Метод Монте-Карло является основным принципом моделирования систем, содержащих стохастические или вероятностные элементы. Его зарождение связано с работой фон Неймана и Улана в конце 40-х годов XX–ого века, когда они ввели термин «Монте-Карло» и применили этот метод к решению задач ядерных излучений. Применение метода оказалось настолько успешным, что он получил распространение и в других областях науки и техники, включая экономические науки.",
          "В методе Монте-Карло данные предшествующего опыта вырабатываются искусственно путем использования некоторого генератора случайных чисел в сочетании c интегральной функцией распределения вероятностей для исследуемого процесса. При зарождении метода таким генератором являлись таблицы случайных величин, игральные кости или колесо рулетки, в настоящее время практически всегда генератором случайных чисел является компьютерная программа. "
        ]
      },
      {
        "path": "statisticalsimulation-2",
        "theme": "Сущность статистического имитационного моделирования",
        "paragraphs": [
          "Сущность СИМ становится понятной после рассмотрения простого примера. Требуется изучить функционирование простой системы массового обслуживания – магазина с одним продавцом. При этом известно, что интервалы времени между приходом покупателей составляет от 1 до 10 мин, причем длительность интервала на этом отрезке подчинена закону равномерной плотности. Случайное время обслуживания покупателя продавцом составляет от 1 до 6 мин и также распределено равномерно. Требуется определить среднее время ожидания покупателем обслуживания и загрузку продавца. ",
          "Даже такая простая задача не может быть решена с использованием аналитической модели, так как при принятых потоках событий решение не сводится к уравнениям и формулам. В то же время решение задачи методами СИМ весьма просто и осуществляется в следующей последовательности: ",
          "1. С помощью генератора случайных чисел получаем с точностью до минуты реализацию случайного времени обслуживания первого покупателя t . ",
          "2. С помощью генератора случайных чисел получаем с точностью до минуты реализацию случайного интервала между приходом первого и второго покупателя t . ",
          "При каждой новой серии испытаний, т.е. при каждом моделировании, результаты будут несколько изменяться, но при увеличении числа испытаний в серии результаты будут все более и более стабилизироваться, стремясь к постоянным величинам, равным математическим ожиданиям определяемых величин. В рассмотренном примере функционирование системы «продавец-покупатель» полностью определяется лишь двумя случайными величинами – интервалом между приходами покупателей (характеристика потока заявок) и временем обслуживания покупателя (характеристика потока обслуживания), которые приняты распределенными равномерно. Можно рассматривать не два, а любое количество случайных факторов, подчиненных любым законам распределения.",
          "Из примера видно, что СИМ состоит из большого числа испытаний (прогонов), поэтому этот метод иначе называют методом статистических испытаний. В каждом из испытаний происходят или не происходят некоторые учитываемые события, вероятности которых заданы, а также реализуются какие-то значения учитываемых случайных величин, законы распределения которых должны быть известны. "
        ]
      },
      {
        "path": "statisticalsimulation-3",
        "theme": "Идентификация закона распределения",
        "paragraphs": [
          "Если некоторые из элементов системы ведут себя стохастически, то в процессе моделирования возникает проблема: как проверить совместимость экспериментальных данных с некоторым теоретическим распределением? Иначе говоря, возникает вопрос: соответствует ли частота наблюдаемых выборочных значений той частоте, с которой они должны бы появляться при некотором вероятностном распределении, отвечающем определенному теоретическому закону? Если частота наблюдаемых событий (значений измеряемой величины) близка к величине, предсказываемой теорией, то в дальнейшем можно строить модель исходных или ожидаемых событий на основе теоретического распределения. ",
          "Обычно не представляется возможным высказать разумную догадку (гипотезу) относительно распределения случайной переменной, пока не будет собрано и проанализировано достаточное количество экспериментальных данных. ",
          "Если определяется закон распределения дискретной переменной, то определяются частоты появления каждого из ее возможных значений. Если переменная непрерывная, весь диапазон ее значений разбивается на равные интервалы (группы) и определяется частота появления переменной в каждой группе. Относительная частота для каждой группы равна частному от деления наблюдаемого числа событий данной группы на общее число событий.",
          "Первый этап в процессе определения подходящего закона распределения вероятностей – визуальное сравнение полученной гистограммы с известными теоретическими кривыми (равномерное распределение, нормальное распределение, распределение Пуассона, экспоненциальное распределение, гамма-распределение и т.д.). Однако такое визуальное распределение позволяет лишь сделать предположение о характере распределения и никогда не дает достаточных оснований, чтобы окончательно принять некоторую гипотезу о виде теоретического распределения.",
          "Еще один широко используемый критерий для статистической проверки гипотез был предложен Смирновым в 1939 г. и в дальнейшем развит самим автором и Колмогоровым. Критерий Колмогорова-Смирнова применяется в тех случаях, когда проверяемое распределение непрерывно и известны среднее и дисперсия совокупности. Проверка соответствия между распределением совокупности эмпирических данных и некоторым конкретным теоретическим распределением осуществляется путем задания интегральной функции, следующей из теоретического распределения, и ее сравнения с интегральной функцией распределения эмпирических данных. ",
          "В настоящее время для статистической обработки эмпирических данных используются пакеты прикладных программ, позволяющие быстро и с высокой точностью выбрать теоретический закон распределения и его основные параметры. "
        ]
      },
      {
        "path": "statisticalsimulation-4",
        "theme": "Связь СИМ с теорией массового обслуживания",
        "paragraphs": [
          "Во многих областях экономики, финансов, производства и быта важную роль играют системы специального вида, реализующие многократное выполнение однотипных задач. Подобные системы называют системами массового обслуживания (СМО). СМО представляет собой совокупность пунктов, на которые в случайные или неслучайные моменты времени поступают заявки на обслуживание, подлежащие удовлетворению. ",
          "В классической теории массового обслуживания математическое функционирование СМО описывается с помощью аппарата конечных систем дифференциальных уравнений, в результате чего удается выразить в явном виде основные характеристики эффективности СМО через ее параметры и параметры потока заявок. Аналогичные задачи могут быть решены и использованием метода Монте-Карло. Поэтому целесообразно при использовании метода СИМ использовать принятые в теории массового обслуживания показатели эффективности работы стохастической системы, которые можно разбить на три основные группы. ",
          "1. Показатели эффективности использования СМО:",
          "1.1. Абсолютная пропускная способность СМО - среднее число заявок, которое сможет обслужить СМО в единицу времени. ",
          "1.2. Относительная пропускная способность СМО – отношение среднего числа заявок, обслуживаемых СМО в единицу времени, к среднему числу поступивших заявок за это же время. ",
          "1.3. Средняя продолжительность периода занятости СМО. ",
          "1.4. Коэффициент использования СМО – средняя доля времени, в течение которого СМО занята обслуживанием заявок. ",
          "2. Показатели качества обслуживания заявок: ",
          "2.1. Среднее время ожидания заявки в очереди. ",
          "2.2. Среднее время пребывания заявки в СМО. ",
          "2.3. Вероятность отказа заявке в обслуживании без ожидания. ",
          "2.4. Вероятность того, что поступившая заявка немедленно будет принята к обслуживанию. ",
          "2.5. Закон распределения времени ожидания заявки в очереди. ",
          "2.6. Закон распределения времени пребывания заявки в СМО. ",
          "2.7. Среднее число заявок, находящихся в очереди. ",
          "2.8. Среднее число заявок, находящихся в СМО и т.д. ",
          "3. Показатели эффективности функционирования пары «СМО – потребитель».",
          "Классификация СМО приведена в книге. ",
          "По числу каналов СМО подразделяют на одноканальные (когда имеется один канал) и многоканальные, когда количество каналов больше двух. Каждый канал одновременно может обслуживать только одну заявку и, если не оговорено специально, каждая находящаяся под обслуживанием заявка обслуживается только одним каналом. Многоканальные СМО могут состоять из однородных каналов, либо из разнородных, отличающихся длительностью обслуживания одной заявки. ",
          "По дисциплине обслуживания СМО подразделяют на три класса: ",
          "1. СМО с отказами (нулевым ожиданием или явными потерями), в которых заявка, поступившая на вход в СМО в момент, когда все каналы заняты, получает «отказ» и покидает СМО («пропадает»). Чтобы эта заявка все же была обслужена, она должна снова поступить на вход в СМО и рассматриваться при этом как заявка, поступившая впервые. ",
          "2. СМО с ожиданием (неограниченным ожиданием или очередью). В таких системах заявка, поступившая в момент занятости всех каналов, становится в очередь и ожидает освобождения канала, который примет ее к обслуживанию. Каждая заявка, потупившая на вход, в конце концов будет обслужена.",
          "3. СМО смешанного типа (с ограниченным ожиданием). Это такие системы, в которых на пребывание заявки в очереди накладываются некоторые ограничения. Эти ограничения могут накладываться на длину очереди, время пребывания в очереди или в СМО и т.д. ",
          "В СМО с ожиданием и в СМО смешанного типа применяются различные схемы обслуживания заявок из очереди. Обслуживание может быть упорядоченным, когда заявки из очереди обслуживаются в порядке их поступления в систему, и неупорядоченным, при котором заявки из очереди обслуживаются в случайном порядке. Иногда применяется обслуживание с приоритетом, когда некоторые заявки из очереди считаются приоритетными и поэтому обслуживаются в первую очередь.",
          "По ограничению потока заявок СМО делятся на замкнутые и открытые (разомкнутые) Если поток заявок ограничен и заявки, покинувшие систему, могут в нее возвращаться, то СМО является замкнутой, в противном случае – открытой.",
          "По количеству этапов обслуживания СМО делятся на однофазные и многофазные. Если каналы СМО однородны, т.е. выполняют одну и ту же операцию обслуживания, то такие СМО называются однофазными. Если каналы обслуживания расположены последовательно и они неоднородны, так как выполняют различные операции обслуживания, то СМО называется многофазной. "
        ]
      },
      {
        "path": "statisticalsimulation-5",
        "theme": " Автоматизация процесса статистического имитационного моделирования",
        "paragraphs": [
          "На протяжении десятилетий при создании имитационных моделей использовался алгоритмический подход, а программы разрабатывались с использованием стандартных языков программирования. Создание таких имитационных моделей требует значительных затрат времени и высокой квалификации разработчиков. Поэтому с середины 70-х годов стали появляться инструментальные средства имитационного моделирования, обладающие собственными языковыми средствами. Обзор этих систем приведен в книге. Авторами рассматривается концепция имитационного моделирования экономических процессов, основанная на специальном аппарате формального манипулирования узлами, транзактами, событиями и ресурсами, на основе которой была разработана система моделирования Pilgrim, на примере которой можно изучить подходы к процессам автоматизации СИМ.",
          "Концепция моделирующей системы базируется на нижеизложенных основных понятиях. ",
          "1. Граф модели – совокупность множества элементов и множества соответствий, отношений между элементами. Граф изображается в виде схемы, геометрически, при этом элементы множества элементов являются вершинами графа, а элементы множества соответствий – отрезками, соединяющими вершины. ",
          "2. Транзакт – формальный запрос на какое-либо обслуживание. Транзакт может порождать группы (семейства) других транзактов, поглощать другие транзакты конкретного семейства; захватывать и использовать ресурсы; определять времена обслуживания, накапливать информацию о пройденном пути и иметь информацию о своем дальнейшем пути и о путях других транзактов. Основными параметрами транзактов являются идентификаторы транзакта и его семейства, наборы различных ресурсов, которые может использовать транзакт; время жизни транзакта, приоритет в очереди, параметры обслуживания. ",
          "3. Узлы графа сети представляют собой центры обслуживания транзактов. В узлах транзакты могут задерживаться, обслуживаться, порождать семейства новых транзактов, уничтожать другие транзакты. ",
          "4. Событием называется факт выхода из узла одного транзакта. События всегда происходят в определенные моменты времени. Они могут быть связаны и с точкой пространства. Интервалы между двумя соседними событиями в модели – это, как правило, случайные величины. ",
          "5. Ресурс независимо от его природы в процессе моделирования может характеризоваться тремя общими параметрами: мощностью, остатком и дефицитом. Мощность ресурса – это максимальное число ресурсных единиц, которые можно использовать для различных целей. Остаток ресурса – число незанятых на данный момент единиц, которые можно использовать для удовлетворения транзактов. Дефицит ресурса – количество единиц ресурса в суммарном запросе транзактов, стоящих в очереди к данному ресурсу. При решении задач динамического управления ресурсами можно выделить три основных типа: материальные, информационные и денежные ресурсы",
          "Использование системы Pilgrim позволяет разработать имитационную статистическую модель без использования алгоритмического подхода. Используемая в ней концепция позволяет разрабатывать два типа моделей: разомкнутые и замкнутые. Разомкнутые модели реализуют исследование внутренних процессов в экономической системе, но они не учитывают взаимосвязи с объектами внешней среды. Замкнутые модели позволяют учесть влияние внешней среды и исследовать связь социальноэкономического объекта с другими объектами.",
          "Для того чтобы преодолеть сложности, возникающие при описании больших моделей, в системе Pilgrim используется графический конструктор моделей, позволяющий автоматизировать процесс создания графа модели и автоматически генерировать код Pilgrim-программы. Тем самым снимаются проблемы, возникающие при ручном кодировании модели в виде Pilgrim-файла. Автоматическая генерация программного кода позволяет пользователю не задумываться о структуре и синтаксисе программы, уделяя все внимание структуре и параметрам самой модели и ее узлов. ",
          "Основное достоинство конструктора Pilgrim заключается в том, что он позволяет:",
          "- проводить многоуровневую иерархическую декомпозицию глобального процесса, разлагая его на составляющие компоненты (проводить структурный системный анализ);",
          "- представлять каждый уровень структурной детализации в виде графического слоя; ",
          "- автоматически генерировать программный текст модели. "
        ]
      }
    ]
  },
  {
    "id": "8",
    "title": "Метод экспериментальной оптимизации",
    "path": "experimentaloptimizationmethod",
    "subjects": [
      {
        "path": "experimentaloptimizationmethod-1",
        "theme": "Сущность метода экспериментальной оптимизации",
        "paragraphs": [
          "Проведение имитационных экспериментов по принципу исследования влияния входных параметров системы на ее выходные параметры позволяет производить сравнение различных управленческих решений, однако при этом всегда возникает сомнение, оптимальным ли является выбранное решение и не существует ли других, более выгодных решений. Классический подход к решению задач оптимизации состоит в определении экстремальных значений целевой функции. При этом для моделей сложных социально-экономических систем наиболее распространены численные методы. Численные методы – это итерационные вычислительные процессы для определения экстремальных состояний модели. ",
          "С вычислительной точки зрения процесс поиска оптимальных решений с помощью численных методов состоит из следующих многократно повторяющихся этапов: ",
          "1. Выбор начального значения переменных и расчет соответствующего им значения целевой функции, ",
          "2. Выбор направления и шага изменения переменных, ",
          "3. Определение нового значения переменных, соответствующих уравнениям модели, и расчет нового значения целевой функции;",
          "4. Сравнение предыдущего и последующего значений целевой функции, переход к п.2 либо остановка процесса при достижении экстремума. ",
          "Если при нахождении максимального (минимального) значения целевой функции последующее значение меньше (больше) предыдущего, то направление корректировки управляемых переменных меняется. Если по любому направлению происходит ухудшение целевой функции, то считается, что оптимальное значение переменных найдено. ",
          "Если исследуемый объект настолько сложен, что его математическая модель непригодна для применения аналитических или численных методов, то для его исследования применяют метод экспериментальной оптимизации. При этом методе как целевая функция, так и система ограничений могут быть заданы в виде алгоритма, позволяющего вычислять их значения в ходе моделирования. ",
          "В процессе реализации данного метода, так же как и для любого численного метода, выполняются перечисленные выше этапы: выбор начальных значений переменных, расчет значения целевой функции, определение направления и шага изменения переменных и т.д., в связи с чем он является численным методом, имеющим своеобразные отличия. "
        ]
      },
      {
        "path": "experimentaloptimizationmethod-2",
        "theme": "Формирование концептуальной модели",
        "paragraphs": [
          "Если при проведении имитационного эксперимента по принципу «А что будет, если…?», не предъявляется особых требований к формированию каких-либо ограничений на переменные, то при создании оптимизационной имитационной модели перед разработкой математической модели необходимо предварительная разработка концептуальной модели, что позволяет значительно сократить затраты машинного времени. ",
          "Концептуальной моделью называется совокупность качественных зависимостей критериев оптимальности и ограничений от характеристик окружения, параметров и переменных объекта. Другими словами, концептуальная модель определяет, от каких факторов зависит тот или иной показатель или выполнение условия, но н раскрывает количественный характер этих связей. Концептуальная модель является «идеологической» основой будущей математической модели. Именно в ней отражается состав критериев оптимальности и ограничений, определяющих целевую направленность модели. Перевод на этапе формализации качественных зависимостей в количественные преобразует критерий оптимальности в целевую функцию, ограничения – в уравнения связи, концептуальную модель - в математическую. ",
          "Независимо от характера и специфики исследуемого объекта его цели всегда относятся к двум категориям: развития и стабилизации. ",
          "Цели развития направлены на достижение новых, желательных в каком-то смысле состояний или характеристик объекта и соответствуют фазе управления «планирование». Цели развития объекта вытекают из целей системы верхнего уровня или по крайней мере являются им логически непротиворечивыми. Поэтому корректная постановка задач «на развитие» системы обязательно предусматривает рассмотрение целей системы верхнего уровня и ее возможностей, формализующих их критерии оценки и формирование на их основе ограничений, накладываемых системой верхнего уровня на объект исследования. ",
          "Цели стабилизации направлены на сохранение или поддержание в определенном состоянии характеристик объекта и соответствуют фазе управления «регулирование». Эти цели способствуют достижению результатов целей развития (утвержденного плана) и определяются на уровне исследуемой системы. При постановке задач «на стабилизацию» ограничения обусловлены свойствами самого объекта. ",
          "Качественными (точечными) называются цели, которые могут быть или достигнуты, или не достигнуты. Все результаты, приводящие к достижению цели, одинаково хороши, а все результаты, не приводящие к достижению цели, одинаково неудовлетворительны. Критерии оценки достижения подобных целей принимают два значения: 1 – успех, 0 – неуспех. Чаще всего в модели подобные цели выступают в качестве ограничений. ",
          "Количественными (интервальными) называются цели, определение которых заключается в стремлении увеличить (или уменьшить) значение некоторой величины – критерия оптимальности, зависимость которой от переменных и факторов модели и составляет целевую функцию математической модели."
        ]
      },
      {
        "path": "experimentaloptimizationmethod-3",
        "theme": "Принципы выбора критерия оптимальности",
        "paragraphs": [
          "При моделировании социально-экономических объектов наиболее общий вид критерия оптимальности выглядит следующим образом: ",
          "где E - критерий оптимальности, - результат, получаемый от работы объекта, R С- затраты на создание результата, _ - вектор параметров объекта, характеризующих его состояние, p(t) t - время, f - некоторая форма связи между отдельными составляющими критерия. ",
          "Критерий подобного вида называют обобщенным критерием оптимальности. Основными составляющими критерия оптимальности являются затраты, результат и время. На практике под результатом понимают конечный эффект функционирования объекта по его основному назначению, в том числе, соответствующий целям создания объекта, и побочный результат, связанный с отрицательным воздействием на окружение. ",
          "Конкретная форма обобщенного критерия оптимальности, т.е. форма связи результата R c затратами С, определяется принципом, положенным в основу решения о целесообразности создания системы. Наиболее распространенными являются пять принципов.",
          "Содержанием первого устанавливается обязательность получения прибыли от работы системы, причем чем больше прибыль, тем оптимальнее система. Формализацией этого принципа является критерий типа прибыли",
          "E = R −C → max.",
          "Второй принцип предполагает максимизацию результата на единицу затрат; его формализацией является критерий типа отношения",
          "E = R/C → max.",
          "Любая из характеристик результата R и затрат С при фиксированной величине другой может быть критерием оптимальности: ",
          "максимизация результата при объеме расходуемых ресурсов не выше заданного:",
          "E = R → max, C ≤ Cmax ; ",
          "минимизация затрат при уровне результата не ниже заданного: ",
          "E = С → min, R ≥ Rmin . ",
          "При проектировании и управлении социально-экономическими системами используется принцип, который формируется как максимальный темп приближения эффективности к потенциально достижимому. Формализацией его является критерий вида",
          "E = ∆R/∆C → max.",
          "Естественно, что варианты, являющиеся оптимальными по какому-то одному из рассмотренных критериев, вовсе не обязательно будут оптимальными по другим критериям."
        ]
      },
      {
        "path": "experimentaloptimizationmethod-4",
        "theme": "Разработка алгоритма оптимизации",
        "paragraphs": [
          "При использовании метода экспериментальной оптимизации с использование имитационной модели объекта перед исследователем помимо создания моделирующего алгоритма возникают проблемы разработки алгоритма оптимизации, включающего моделирующий алгоритм в качестве одного из элементов – этапа расчета значения целевой функции для определения значений переменных. Для этого должна быть продумана алгоритмическая и программная реализация решения оптимизационной задачи. ",
          "Существует два метода экспериментального поиска оптимальных решений: параллельный и последовательный. При использовании параллельного метода все комбинации значений переменных, при которых должны рассчитываться значения целевой функции, выбираются заранее, в то время как в случае применения последовательного метода заранее определяется несколько начальных значений, а остальные выбираются лишь по мере накопления данных. ",
          "Два основных параллельных метода называются методом случайного поиска и методом многофакторного анализа. Эти методы основаны на априорном выборе определенных интервалов изменения переменных , , … , . Границы этих интервалов определяются, с одной стороны, из предположения, что внутри них находятся оптимальные значения , , … , , а с другой – из условия выполнения ограничений модели. ",
          "В первом методе случайным образом устанавливаются точки эксперимента, в которых значения , , … , принадлежат этим интервалам, причем выбор значения каждой переменной производится независимо. Для каждой зафиксированной точки рассчитывается значение целевой функции. В качестве решения выбирается такая точка, для которой целевая функция принимает экстремальное значение, либо производится более тщательный поиск экстремума в окрестностях этой точки.",
          "При использовании метода многофакторного анализа интервалы изменения каждой из n переменных разбиваются на m подинтервалов, которые определяют уровни их изменения. Значения переменных для точек эксперимента формируют путем объединения значений по каждому уровню для всех переменных, что дает в результате N экспериментов (полный многофакторный эксперимент). Далее для каждой точки рассчитывается значение целевой функции и либо выбирается наилучшая точка, либо более тщательно (т.е. с меньшей величиной подинтервалов) исследуется окрестность этой точки.",
          "Последовательные методы экспериментального поиска чаще всего основаны на принципах построения численных методов, среди которых можно выделить симплекс-метод, метод покоординатной оптимизации, градиентный метод и его модификации. "
        ]
      },
      {
        "path": "experimentaloptimizationmethod-5",
        "theme": "Эвристические алгоритмы поиска наилучших решений с использованием имитационной модели",
        "paragraphs": [
          "К сожалению, далеко не всегда возможно проведение экспериментального поиска оптимального решения на принципах численных методов. Трудности строгой математической формализации и разработки методов нахождения оптимальных решений в задачах проектирования сложных систем и управления ими привели к созданию так называемых эвристических алгоритмов поиска наилучших решений разнообразных практических задач. Такие алгоритмы формализуют опыт специалистов в тех или иных специфических областях. С содержательной точки зрения эвристические алгоритмы представляют собой набор правил конструирования, сравнения, анализа и отбора вариантов возможных решений. От алгоритмов математического программирования эти алгоритмы отличаются тем, что они не гарантируют получения оптимального решения - в них производится выбор наилучшего решения из просмотренных. Эвристические алгоритмы обычно применяются для проектирования и управления объектами с большим набором признаков и свойств, для которых, с одной стороны, затруднительно полной математическое описание, а с другой – возможно построить достаточно простые и гибкие правила отбора вариантов.",
          "Например, если использовать имитационную модель птицеводческого предприятия для поиска оптимального значения входных параметров с целью поиска максимального значения критерия оптимизации – прибыли, то при стандартном подходе придется применять алгоритм оптимизации для модели, включающей сотни значимых параметров. Даже если удастся разработать такой алгоритм и получать решения в разумные сроки, вряд ли на практике можно будет изменять такое количество параметров. Между тем, специалисты из предыдущего практического опыта знают, что разные параметры имеют разную значимость для конечного результата. Так, если известно, что в себестоимости конечного продукта – мяса птицы или яйца корма занимают 60-70%, то разумно сначала оптимизировать состав кормов с целью минимизации стоимости рациона. Это стандартная задача определения оптимального состава смеси компонентов (рациона). В задачах этого типа требуется, чтобы входящие в состав смеси компоненты могли придать ей нужные свойства и одновременно удовлетворяли экономическим условиям производства. ",
          "Постановка задачи заключается в следующем. Пусть некоторый рацион может быть составлен различными способами в результате смешивания нескольких различных компонентов, имеющихся на складах предприятия или предлагаемых на рынке. В состав каждого компонента входят различные вещества, требуемые для развития живого организма. При этом известно или может быть определено в лаборатории содержание каждого вещества в каждом компоненте. ",
          "В модели используются следующие обозначения: ",
          "I – наименование компонента, I = 1, 2, …m; ",
          "j – наименование компонента, j = 1, 2, …n. ",
          "Неизвестные: ",
          "xi - количество I – ого компонента, входящего в состав смеси. ",
          "xi Правые части ограничений: ",
          "b j - норма j- ого вещества в составе смеси. ",
          "Коэффициенты: ",
          "aij - содержание j- ого вещества в I- ом компоненте, ",
          "сi - затраты, связанные с использованием I – ого компонента при образовании смеси. "
        ]
      }
    ]
  },
  {
    "id": "9",
    "title": "Управленческие имитационные игры",
    "path": "simulationgames",
    "subjects": [
      {
        "path": "simulationgames-1",
        "theme": "Природа имитационных игр",
        "paragraphs": [
          "В последние десятилетия имитационные игры бурно развиваются, с одной стороны, как метод обучения, с другой – как инструмент системного анализа, направленный на исследование функционирования сложных социально-экономических систем. Имитационные игры позволяют распространить системный анализ на исследование динамики систем с учетом организационно-правового и социально-психологического аспектов. Учебные имитационные игры, которые называют деловыми играми, служат методом активизации процесса обучения. ",
          "Глубокое понимание природы имитационных игр возможно только в случае рассмотрения их как подмножества более широкого класса явлений, объединяемых термином «игра». Этот класс явлений очень обширен и разнообразен. Сюда входят игры детей и взрослых, игры салонные и спортивные, военные, управленческие и т.д.",
          "Игра – вид человеческой деятельности, способный воссоздавать другие виды человеческой деятельности. Деятельность-игра происходит в измененных, по сравнению с действительностью, искусственных условиях (в условиях мнимой, экспериментальной ситуации). При этом, для деятельности-игры характерна определенная двуплановость (серьезность и условность), что роднит ее с художественной деятельностью, но в отличие от нее деятельность-игра всегда представляет собой эксперимент с импровизированным в значительной степени поведением. ",
          "Имитационными играми называются такие игры, в которых важной частью воссоздания экспериментальной ситуации является имитационная модель среды, в которой исполнители ролей, моделируемые игроками, осуществляют свою деятельность. Имитационная модель среды отражает в динамике результаты (условные) деятельности игроков. ",
          "Имитационные игры принадлежат к классу ролевых игр. С помощью ролевых игр дети осваивают жизнь взрослых с ее социальными нормами. Детская ролевая игра возникла на определенной стадии развития человеческого общества, когда освоение детьми производственных приемов и социальных норм путем непосредственного включения в усложнившийся производственный процесс стало невозможным. ",
          "Все ролевые игры, по-видимому, произошли из общего с искусством корня – первобытного действа. Последнее выполняло функцию подготовки и мобилизации первобытной группы для совместной деятельности (например, охоты), а также закрепляло положительный опыт после ее завершения. Впоследствии искусство и игра дифференцировались, но сохранили по крайней мере две общие черты – моделирующий характер и двуплановость.",
          "Непосредственными предшественниками управленческих имитационных игр были игры военные. Они возникли и стали применяться для практических целей в периоды наполеоновских войн, когда характер боевых действий настолько усложнился, что отвлеченное теоретическое продумывание операций стало затруднительным. Военные игры дают возможность отрабатывать управление войсками в безопасных лабораторных условиях. ",
          "Аналогично, на определенном этапе развития человеческого общества возникла настоятельная необходимость изучения экономических систем. Теоретические методы оказались недостаточными для этой цели. На такое же препятствие наталкивается ребенок дошкольного возраста, психическое развитие которого еще не дает ему возможности познавать жизнь взрослых с помощью отвлеченной теоретической деятельности, а путь натурного эксперимента перед ним закрыт. Именно тогда ребенок и обращается к игре как к экспериментальному методу познания в лабораторных условиях. В науке и практике, осознав недостаточность теоретических методов, ученые неизбежно пришли к необходимости использования имитационных игр, поскольку проведение натурных экспериментов для изучения экономической деятельности имеет ограниченное значение из-за возможных отрицательных социальных и экономических последствий такого экспериментирования. "
        ]
      },
      {
        "path": "simulationgames-2",
        "theme": "Сущность имитационных игр",
        "paragraphs": [
          "Известно, что экономическая наука может совершенствовать процесс управления экономикой двумя путями – рационализацией управления и учебой управленческих кадров разного уровня. Одним из наиболее эффективных способов повышения квалификации управленца является его участие в управленческих имитационных играх, особенно, с использованием имитационных моделей тех систем, подсистем и надсистем, в управлении которыми он участвует. ",
          "В обыденном сознании слово «игра» ассоциируется с понятиями «соревнование», «противоборство», «подражание», «несерьезность», «условность» и т.п.. Иногда игру определяют как непродуктивный вид деятельности, где важен процесс, а не результат.",
          "Игровая система управления отличается от ее реального аналога главным образом тремя качествами: реальные работники аппарата управления заменяются исполнителями ролей этих работников (в этом заключается игровой аспект данного вида моделей); реальная информация о производстве заменяется псевдореальной информацией, получаемой с помощью имитации производственных процессов (в этом заключается имитационный аспект рассматриваемых моделей); в игре, как правило, сжимается масштаб времени и упрощается организационная структура (в этом заключается экспериментальный характер игровых моделей). ",
          "Имитационная игра включает в себя пять крупных составляющих: игроков, экспертов, организаторов игры, материал по изучаемой проблеме и экспериментальную ситуацию, которую образует игровая обстановка, сценарий и регламент игры. Важной частью игровой обстановки является имитационная модель среды, в которой изучаемая система осуществляет свою деятельность.",
          "Двуплановость имитационной игры проявляется в двух типах деятельности: игровой (условность) и деятельности по поводу игры(серьезность). Игровая деятельность связана с функционирование игроков как представителей имитируемой экономической системы (выполнение игровых ходов, принятие игровых решений и т.п.). Деятельность по поводу игры осуществляется как за пределами игровой деятельности (послеигровая дискуссия, обобщение и анализ полученной экспертной информации и т.д.). Деятельность по поводу игры является важнейшей в игровом имитационном эксперименте. Игровая же деятельность служит поводом, рамками и эмпирической базой для развертывания деятельности по поводу игры",
          "В конце 50-х годов XX-ого века в США был проведен первый эксперимент на базе управленческой имитационной игры с использованием ЭВМ. Эта игра была разработана в фирме «American management association» (AMA) и послужила прототипом для множества имитационных игр. В игре AMA моделируется деятельность пяти компаний, производящих единственный продукт и сбывающий его на общем рынке. Каждую компанию представляет команда, в которую входит от трех до пяти человек. Время игры делится на периоды. Каждый период команды должны принимать решение о значениях управляющих параметров.",
          "Управленческие игры подобного типа преследовали следующие цели: развитие управленческих навыков, активное усвоение концепций и методов управления, принятие навыков в применении этих концепций и методов на практике, получение комплексного представления об объекте управления. ",
          "При применении имитационных игр исследователь неизбежно сталкивается с вопросом о том, как понимать результаты игровых имитационных экспериментов и как оценивать их качество. Оба эти вопроса порождают проблему обоснования, валидности управленческих имитационных игр. "
        ]
      },
      {
        "path": "simulationgames-3",
        "theme": "Основные направления использования игрового метода решения проблем",
        "paragraphs": [
          "Имитационные игры можно рассматривать как метод изучения процессов развития социально-экономических систем. Познавательный эффект имитационных игр обусловлен комбинированным использованием трех методов: аналитического, экспертного и экспериментального. ",
          "С помощью аналитического метода конструируется игра. В процессе такого конструирования анализируется большой фактический материал, выделяются важные элементы и связи, формулируются гипотезы и теоретические положения по поводу изучаемых явлений. В начале применения имитационных игр практиковались так называемые «ролевые деловые игры» без применения ЭВМ. В настоящее же время конструирование игры практически предполагает создание компьютерной имитационной модели изучаемой системы. ",
          "Участие профессионалов в эксперименте активизирует их экспертный потенциал: наблюдая изучаемую систему «изнутри», игроки и эксперты анализируют и переоценивают свой прошлый опыт и знания. ",
          "Экспериментальный характер игрового метода определяется тем, что каждое проведение игры можно рассматривать как лабораторный эксперимент с изучаемой системой. Сжатый масштаб времени позволяет многократно воссоздавать динамику функционирования организации. ",
          "Имитационные игры могут применяться для решения различных задач, среди которых можно выделить следующие: ",
          "- обучение, ",
          "- поддержка принятия управленческих решений, ",
          "- организационное проектирование, ",
          "- исследование. ",
          "Как средство обучения имитационные игры обладают тем достоинством, что повышают мотивацию обучаемых, предоставляют возможность применить полученные знания для решения практических задач. ",
          "Применение игр для поддержки принятия управленческих решений предполагает их включение в виде блока в действующую систему управления. Если в экономической системе полностью автоматизированы процессы технологического, материального и финансового планирования, то по своей сути данная автоматизированная система представляет собой имитационную модель, что позволяет принимать решения с рассмотрением множества альтернативных вариантов. Регулярное проведение таких игр позволяет делать прогнозы, вырабатывать мероприятия по развитию производства, отрабатывать организационные структуры и механизмы хозяйствования. ",
          "Применение игр в организационном проектировании означает постановку игровых экспериментов по материалам проектов новых систем. В ходе таких экспериментов проверяются и уточняются принятые проектные решения. ",
          "В экономической науке сбор феноменологической информации осуществлялся в основном методом наблюдения. В естествознании уже давно господствующим методом сбора такой информации стал лабораторный эксперимент, обладающий большими преимуществами перед методом наблюдения. Этот метод в естествознании стал основным для проверки гипотез и теорий. Применение имитационных игр при правильном понимании природы игрового имитационного моделирования позволяет экспериментировать с моделями экономических систем.",
          "Проведение исследований в такой комплексной области, как социально-экономические системы, требует сотрудничества между специалистами разных профилей, а также активного взаимодействия между учеными и практиками. Такое сотрудничество и взаимодействие нередко бывает трудно, а то и невозможно наладить эффективным образом в силу коммуникационного разрыва, объективно существующего между специалистами разных областей науки, а также между учеными и практиками. Возможность преодоления этого разрыва в игровых имитационных экспериментах связана с тем, что общение в них протекает в значительной степени на понятном всем языке действий. ",
          "Само построение игры, представляя собой аналитический акт, дает очень много исследователю в понимании моделируемой системы. Игра представляет собой комплекс гипотез, теоретических положений и зависимостей, известных до начала построения игры и положенных в основу ее конструкции. В процессе разработки игровой имитационной модели эти теоретические построения подвергаются системному обобщению и дополнению таким образом, чтобы созданная игровая модель могла представлять собой теорию исследуемого объекта, более развитую по сравнению с заложенными в ее конструкцию первоначальными теоретическими положениями. В некоторых случаях после построения игровой модели исследуемая проблема становится настолько ясной, что нужда в проведении с ней экспериментов отпадает. Однако в большинстве случаев эксперименты с игрой могут существенно улучшить решение поставленной исследовательской работы.",
          "Таким образом, исследования экономических систем, основанные на имитационных играх, могут иметь следующие цели:",
          "- сбор феноменологической информации путем проведения игровых имитационных экспериментов с изучаемой экономической системой, ",
          "- проверка гипотез и теорий в условиях лабораторного эксперимента,",
          "- организация междисциплинарного и межпрофессионального взаимодействия в процессе исследований, ",
          "- построение теорий путем конструирования игровой имитационной модели. "
        ]
      },
      {
        "path": "simulationgames-4",
        "theme": "Структура и порядок разработки управленческих имитационных игр",
        "paragraphs": [
          "В общем случае исследование поведения социально-экономической системы с использованием имитационных игр осуществляется в следующей последовательности. Прежде всего формулируются цели предстоящего исследования и формируется коллектив специалистов. В этот коллектив включаются разработчики имитационной модели системы. Задачей этого коллектива является создание формализованного представления исследуемого варианта развития исследуемой системы в виде управленческой имитационной игры. Для этого прежде всего формируются гипотезы и теоретические положения относительно исследуемой проблемы развития системы. При этом используются уже известные гипотезы и зависимости и формулируются новые.",
          "На основе сформулированных теоретических положений и гипотез в соответствии с выбранными целями исследования и при помощи разработанной имитационной модели исследуемой системы проводится управленческая имитационная игра. Такая игра должна быть по возможности простой по сравнению с реальной действительностью (чтобы обеспечить обозримость эксперимента), но в то же время и достаточно сложной (чтобы обеспечить необходимый уровень соответствия лабораторного эксперимента реальности). Проверка гипотез в игровом эксперименте не доказывает их правомерности для реальной действительности. Однако такая проверка позволяет ограничить множество гипотез, построить новые и обогатить старые. ",
          "Имитационная игра включает в себя пять крупных составляющих: игроков, экспертов, организаторов игры, материал по изучаемой проблеме и экспериментальную ситуацию ",
          "Цели проведения управленческих имитационных игр можно подразделить на три вида: результат изучаемой деятельности, ее механизм, ее эволюцию. Разные цели предъявляют разные требования к планированию и проведению управленческой игры. Если экспериментаторов прежде всего интересует результат экономической деятельности в тот или иной момент времени, то основное внимание должно быть уделено разработке ресурсно-технологической подсистемы и проигрыванию вариантов ее развития и совершенствования. Если определяется не конкретный результат экономической деятельности, а ее механизм, то основное внимание при разработке имитационной модели уделяется управленческой подсистеме, а при проведении игры исследуется поведенческие аспекты участников процесса управления. Если же исследователей интересуют изменения в механизме экономической деятельности, то основное внимание уделяется нормативной подсистеме. "
        ]
      },
      {
        "path": "simulationgames-5",
        "theme": "Компьютерные деловые игры",
        "paragraphs": [
          "Компьютерные деловые игры в современном понимании чаще всего выступают в виде самостоятельных программ. Помимо игровой составляющей деловые игры часто имеют компоненты обучающих программ: контекстные учебные, нормативные и справочные материалы, тесты и практикумы. В книге приводится перечень определений деловых игр, данных различными авторами. Часть этих определений приводится ниже. ",
          "«Деловая игра в широко распространенном, обычном понимании – это метод имитации принятия управленческих решений в различных производственных ситуациях путем игры по заданным правилам группы людей или человека с ЭВМ в диалоговом режиме» (Бельчиков Я.М., Бирштейн М.М). ",
          "«Деловая игра – это имитация реальных производственноэкономических процессов с целью формирования у обучаемых экономического мышления» (Козленке Н.Н.). ",
          "«Деловая игра – активный метод обучения, использующий имитацию реального изучаемого объекта для создания у обучаемых наиболее полного ощущения реальной деятельности в роли лица, принимающего решения» (Павлов С.Н.). ",
          "Таким образом, деловые игры предназначены прежде всего для использования в процессе обучения. Известно, что педагогическая эффективность использования деловых игр в учебном процессе очень высока. Так, при использовании деловой игры усваивается до 90% информационного материала, в то время как при его лекционной подаче – 20%. Это объясняется тем, что лучше усваивается то, что «интересно», а также то, до чего человек дошел своим «личным опытом». При усвоении знаний в игровой форме меняется мотивация обучения: знания усваиваются не про запас, а для обеспечения непосредственных игровых успехов обучающихся в реальном для них процессе. Помимо этого достоинством деловых игр является радикальное сокращение времени накопления опыта."
        ]
      },
      {
        "path": "simulationgames-6",
        "theme": "Лабораторная работа с использованием деловой игры «Фермер»",
        "paragraphs": [
          "Лабораторная работа по курсу «Имитационное моделирование экономических процессов» проводится с использованием деловой компьютерной игры «Фермер», разработанной автором данного курса. ",
          "Цель игры – моделирование экономических процессов в агропромышленной отрасли, усвоение взаимосвязи множества различных факторов, влияющих на успех деятельности фермера. Игра позволяет моделировать деятельность фермера или какого-либо структурного подразделения агропромышленного комплекса на протяжении многих лет игрового времени. Конечный успех в игре зависит от правильного разрешения возникающих на каждом шаге игры задач. Результат деятельности фермера зависит от агротехнических факторов (выбор культур, правильный севооборот, соблюдение сроков выполнения всех технологических операций), технических факторов (оптимального состава машинно-тракторного парка, условий хранения техники), биологических (создание условий для хранения семян и урожая), экономических (выбор цен и сроков при покупке и продаже, величина затрат на производство каждого вида товарной продукции) и многих-многих других факторов. ",
          "В левом верхнем окне изображается текущее состояние обрабатываемых фермером полей, в правом верхнем окне – текущее состояние «хозяйства» фермера – сооруженные им постройки, в нижнем окне показывается имеющаяся техника и сооружения для ее хранения. Процесс управления игрой осуществляется при помощи диалоговых экранных форм, появляющихся на экране при обращении к соответствующим разделам главного меню, а пошаговое изменение игрового времени осуществляется при помощи экранных клавиш «Закончить день» и «Закончить месяц». ",
          "Изложение основных правил игры выходит за рамки данного издания, с ними каждый обучающийся может ознакомиться непосредственно перед началом игры в разделе «Справки» программы.",
          "Конечная цель игры – достижение наибольшего ежегодного дохода фермера"
        ]
      }
    ]
  }
]
